⺁
⺂
⺃
⺄
⺅
⺆
⺇
⺈
⺉
⺊
⺋
⺌
⺍
⺎
⺏
⺐
⺑
⺒
⺓
⺔
⺕
⺖
⺗
⺘
⺙
⺛
⺜
⺝
⺞
⺠
⺡
⺢
⺣
⺤
⺥
⺦
⺧
⺨
⺩
⺪
⺫
⺬
⺭
⺮
⺯
⺰
⺱
⺲
⺳
⺴
⺵
⺶
⺷
⺸
⺹
⺺
⺻
⺼
⺽
⺾
⺿
⻀
⻁
⻂
⻃
⻄
⻅
⻆
⻇
⻈
⻉
⻊
⻋
⻌
⻍
⻎
⻏
⻐
⻑
⻒
⻓
⻔
⻕
⻖
⻗
⻘
⻙
⻚
⻛
⻜
⻝
⻞
⻟
⻠
⻡
⻢
⻣
⻤
⻥
⻦
⻧
⻨
⻩
⻪
⻫
⻬
⻭
⻮
⻯
⻰
⻱
⻲
〩
ソ
㐅
㐌
㐪
㐫
㐬
㐭
㐮
㐱
㐻
㑁
㑄
㑍
㑏
㑘
㑝
㑪
㑫
㑲
㑳
㑹
㑽
㒌
㒔
㒙
㒷
㒸
㒼
㓁
㓂
㓊
㓙
㓜
㓞
㓟
㓠
㓣
㓤
㓭
㓶
㓸
㔧
㔫
㔾
㕑
㕓
㕛
㕠
㕡
㕣
㕧
㕨
㕪
㕫
㕭
㕰
㕱
㕲
㕳
㕵
㕷
㕸
㕽
㖀
㖂
㖃
㖅
㖆
㖇
㖏
㖑
㖒
㖔
㖕
㖗
㖘
㖞
㖠
㖡
㖣
㖤
㖦
㖧
㖨
㖪
㖫
㖭
㖮
㖵
㖷
㖸
㖹
㖺
㖻
㖼
㖽
㗀
㗁
㗂
㗅
㗇
㗈
㗊
㗌
㗍
㗑
㗒
㗔
㗕
㗖
㗘
㗙
㗚
㗜
㗞
㗢
㗣
㗦
㗩
㗫
㗭
㗰
㗱
㗳
㗴
㗶
㗸
㘁
㘃
㘇
㘈
㘉
㘋
㘌
㘓
㘖
㘗
㘘
㘙
㘛
㘢
㘧
㘨
㘭
㘴
㘾
㘿
㙁
㙋
㙔
㙕
㙗
㙘
㙤
㙩
㙮
㙴
㚁
㚅
㚇
㚘
㚢
㚤
㚴
㛎
㛕
㛖
㛟
㛪
㛱
㜆
㜖
㜥
㜪
㜮
㝁
㝉
㝠
㝡
㝫
㝴
㝵
㝹
㝺
㞑
㞢
㞰
㞳
㞴
㞾
㟁
㟄
㟈
㟉
㟌
㟍
㟕
㟫
㟮
㟳
㟴
㟸
㠈
㠓
㠜
㠦
㠯
㠶
㡀
㡝
㡬
㡭
㡳
㡴
㢆
㢤
㢲
㣊
㣎
㣲
㣺
㣿
㤇
㤈
㤋
㤌
㤏
㤓
㤕
㤙
㤛
㤝
㤡
㤥
㤨
㤪
㤳
㤹
㤾
㤿
㥁
㥃
㥄
㥋
㥍
㥏
㥑
㥘
㥠
㥥
㥪
㥬
㥯
㦃
㦄
㦆
㦉
㦑
㦓
㦖
㦗
㦡
㦦
㦨
㦸
㧅
㧊
㧌
㧍
㧏
㧐
㧑
㧓
㧗
㧙
㧜
㧝
㧡
㧢
㧤
㧪
㧯
㧴
㧵
㧶
㧺
㧼
㧽
㧾
㨁
㨂
㨃
㨄
㨅
㨆
㨈
㨋
㨎
㨐
㨔
㨕
㨗
㨘
㨞
㨟
㨢
㨥
㨦
㨨
㨪
㨫
㨬
㨯
㨲
㨳
㨴
㨶
㨿
㩃
㩅
㩇
㩍
㩒
㩔
㩗
㩜
㩝
㩞
㩡
㩢
㩥
㩧
㩫
㩱
㩳
㩴
㩹
㪗
㪚
㪣
㪯
㪰
㫋
㫐
㫒
㫖
㫗
㫝
㫧
㫪
㫬
㫭
㫰
㫵
㫻
㫼
㫾
㬋
㬎
㬓
㬙
㬝
㬰
㬳
㬵
㬻
㬿
㭁
㭄
㭉
㭌
㭍
㭎
㭒
㭙
㭞
㭨
㭪
㭬
㭲
㭳
㭴
㭼
㭽
㭿
㮀
㮈
㮔
㮗
㮙
㮛
㮠
㮢
㮧
㮩
㮬
㮮
㮲
㮴
㮷
㮿
㯀
㯂
㯆
㯉
㯊
㯖
㯚
㯝
㯞
㯭
㯮
㯲
㯶
㯷
㯿
㰀
㰁
㰋
㰌
㰖
㰙
㰱
㰼
㱕
㱥
㱮
㲋
㲎
㲸
㲺
㳄
㳉
㳌
㳍
㳏
㳘
㳙
㳚
㳜
㳝
㳟
㳥
㳪
㳬
㳯
㳶
㳹
㳺
㳻
㳾
㴖
㴘
㴜
㴥
㴨
㴫
㴬
㴷
㴽
㵂
㵆
㵊
㵋
㵎
㵒
㵕
㵝
㵢
㵣
㵧
㵩
㵮
㵼
㶑
㶞
㶤
㶥
㶩
㶬
㶲
㷀
㷈
㷋
㷔
㷙
㷚
㷝
㷟
㸃
㸒
㸔
㸙
㸦
㹄
㹟
㹠
㹥
㹦
㹫
㹭
㹯
㹰
㹵
㹺
㺏
㺔
㺗
㺜
㺝
㺞
㺧
㺯
㻋
㻑
㻕
㻠
㻡
㻸
㼓
㼝
㼫
㼳
㽳
㽻
㽿
㾀
㾄
㾆
㾉
㾑
㾔
㾕
㾞
㾮
㾯
㾴
㾵
㾶
㾹
㾺
㾾
㾿
㿂
㿈
㿟
㿡
㿺
㿽
䀝
䀠
䀡
䀧
䀨
䀩
䀭
䀲
䀹
䀻
䁀
䁐
䁖
䁘
䁛
䁝
䁠
䁢
䁩
䁬
䁱
䁲
䁳
䁴
䁻
䁾
䂀
䂓
䂘
䂥
䂨
䂪
䂫
䂾
䃄
䃅
䃆
䃈
䃏
䃛
䃞
䃣
䃹
䄄
䄆
䄇
䄓
䄔
䄚
䄡
䄧
䄪
䄫
䄱
䅒
䅘
䅟
䆂
䆠
䆰
䇄
䇛
䇠
䇪
䇬
䇮
䇴
䇶
䇷
䇸
䇺
䇻
䇿
䈇
䈈
䈊
䈏
䈒
䈜
䈟
䈧
䈪
䈫
䈬
䈭
䈵
䈹
䈺
䈻
䉅
䉒
䉜
䉞
䉤
䉭
䉿
䊇
䊓
䊚
䊟
䊦
䊪
䊷
䊹
䊼
䋃
䋈
䋋
䋎
䋕
䋖
䋘
䋞
䋠
䋡
䋥
䋦
䋰
䋱
䋲
䋻
䋼
䌌
䌑
䌓
䌙
䌝
䌦
䌩
䌫
䌷
䌽
䍃
䏊
䏌
䏍
䏓
䏔
䏕
䏙
䏜
䏝
䏠
䏢
䏦
䏧
䏳
䏴
䏶
䏹
䏺
䏻
䏽
䏾
䏿
䐁
䐏
䐐
䐗
䐜
䐠
䐥
䐧
䐭
䐿
䑃
䑅
䑈
䑓
䑴
䑾
䒑
䒜
䒞
䒡
䒤
䒦
䒭
䒳
䒴
䒸
䒹
䒼
䓀
䓊
䓎
䓒
䓔
䓘
䓙
䓝
䓡
䓣
䓪
䓬
䓴
䔁
䔃
䔅
䔍
䔚
䔩
䔲
䔶
䔻
䔼
䔾
䕃
䕆
䕊
䕒
䕝
䕡
䕣
䕭
䕯
䕱
䕷
䕹
䕺
䕼
䕽
䖇
䖈
䖍
䖏
䖒
䖝
䖡
䖨
䖭
䖳
䖴
䖵
䖷
䗀
䗁
䗂
䗅
䗇
䗊
䗋
䗔
䗠
䗭
䗲
䗼
䘃
䘆
䘏
䘖
䘜
䘝
䘨
䘮
䘹
䙀
䙊
䙚
䙛
䙦
䙴
䚀
䚂
䚟
䚯
䚵
䚿
䛊
䛕
䛖
䛘
䛨
䛩
䛹
䜌
䜛
䜟
䜥
䜭
䜹
䝉
䝋
䝣
䝨
䞮
䟓
䟔
䟘
䟜
䟞
䟢
䟪
䟬
䟻
䟽
䠀
䠇
䠏
䠣
䡆
䡖
䡛
䡥
䢐
䢖
䢜
䢦
䢸
䣋
䣐
䣓
䣗
䣤
䣭
䣷
䤑
䤠
䤣
䤤
䤩
䤲
䤵
䥠
䥽
䦆
䦕
䦚
䦧
䦨
䦻
䧆
䧋
䧍
䧤
䧹
䧺
䨇
䨋
䨔
䨙
䨳
䩆
䩗
䩻
䪞
䪼
䫤
䬕
䬰
䬲
䭔
䮇
䮐
䮒
䮬
䮯
䮴
䮵
䮽
䯄
䯘
䯱
䯻
䰀
䰄
䰸
䰺
䰼
䰾
䱃
䱅
䱊
䱏
䱑
䱒
䱓
䱕
䱙
䱚
䱛
䱟
䱣
䱬
䱲
䱵
䱷
䱸
䱾
䲁
䲂
䲆
䲉
䲋
䲎
䲐
䲔
䲕
䲟
䲢
䲧
䲨
䲲
䲹
䲼
䳂
䳄
䳇
䳌
䳍
䳎
䳐
䳓
䳢
䳦
䳧
䳱
䳽
䳾
䴈
䴉
䴌
䴏
䴓
䴕
䴖
䴟
䴡
䴸
䶊
䶐
䶕
䶝
䶞
䶧
䶶
一
丁
丂
七
丄
丅
丆
万
丈
三
上
下
丌
不
与
丏
丐
丑
丒
专
且
丕
世
丘
丙
业
丛
东
丝
丞
両
丢
丣
两
严
並
丧
丨
丩
个
丫
丬
中
丮
丰
丱
串
临
丶
丷
丸
丹
为
主
丽
举
丿
乀
乂
乃
久
乆
乇
么
义
之
乌
乍
乎
乏
乐
乒
乓
乔
乕
乖
乗
乘
乙
乚
乛
乜
九
乞
也
习
乡
书
乩
买
乱
乳
乴
乸
乹
乾
亂
亅
了
亇
予
争
亊
事
二
亍
于
亏
亐
云
互
五
井
亗
亘
亙
亚
些
亜
亞
亟
亠
亡
亢
交
亥
亦
产
亨
亩
享
京
亭
亮
亱
亲
亵
亶
亷
亸
亹
人
亻
亼
亾
亿
什
仁
仃
仄
仅
仆
仇
仈
仉
今
介
仌
仍
从
仏
仐
仑
仒
仓
仔
仕
他
仗
付
仙
仝
仞
仟
仡
代
令
以
仨
仩
仪
们
仮
仯
仰
仲
仳
仵
件
价
任
份
仿
企
伅
伆
伉
伊
伍
伎
伏
伐
休
伕
众
优
伙
会
伛
伞
伟
传
伢
伤
伦
伧
伩
伪
伫
伮
伯
估
伲
伴
伵
伶
伷
伸
伹
伺
伻
似
伽
佁
佃
但
佇
佈
佊
位
低
住
佐
佑
体
佔
何
佗
佘
余
佚
佛
作
佝
佞
佟
你
佢
佣
佤
佥
佩
佬
佯
佰
佲
佳
佴
併
佶
佷
佺
佻
佼
佾
使
侁
侃
侄
侅
來
侈
侉
例
侍
侏
侑
侔
侖
侘
供
依
侞
侠
侢
侣
侥
侦
侧
侨
侩
侪
侫
侬
侭
侮
侯
侱
侵
侶
侷
侹
侻
侼
便
係
促
俄
俉
俊
俋
俎
俏
俐
俑
俓
俗
俘
俙
俚
俛
俜
保
俞
俟
俠
信
俣
俥
俦
俨
俩
俪
俭
修
俯
俰
俱
俳
俵
俶
俸
俺
俻
俾
倀
倂
倅
倆
倈
倉
個
倌
倍
倎
倏
倐
們
倒
倔
倖
倗
倘
候
倚
倛
倜
借
倠
倡
倢
倣
値
倥
倦
倧
倨
倩
倪
倫
倬
倭
倮
倲
倴
倷
倸
债
倻
值
倾
偀
偃
偅
假
偈
偉
偌
偎
偏
偓
偕
偖
偘
做
停
偣
健
偨
偩
偪
偬
偭
偰
側
偵
偶
偷
偺
偻
偽
偾
偿
傀
傅
傋
傌
傍
傎
傏
傑
傒
傓
傕
傖
傘
備
傚
傜
傠
傢
傣
傥
傦
傧
储
催
傭
傮
傱
傲
傳
傴
債
傷
傺
傻
傾
僂
僃
僄
僅
僇
僈
僉
僊
働
僎
像
僑
僓
僕
僖
僘
僚
僝
僞
僡
僣
僤
僥
僦
僧
僩
僬
僭
僮
僱
僳
僴
僵
僶
僸
價
僻
僽
儀
儁
儂
億
儆
儇
儈
儉
儋
儌
儐
儒
儔
儕
儖
儗
儘
儜
儞
償
儡
儢
儨
優
儱
儲
儳
儷
儸
儺
儻
儼
儾
儿
兀
允
元
兄
充
兆
兇
先
光
克
兌
免
兎
児
兑
兒
兓
兔
兕
兖
兗
党
兜
兠
兢
入
兦
內
全
兩
八
公
六
兮
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
兿
冀
冂
冃
冄
内
冇
冈
冉
冊
冋
册
再
冎
冏
冐
冑
冒
冓
冔
冕
冖
冗
冘
写
军
农
冝
冞
冠
冡
冢
冤
冥
冦
冩
冪
冫
冬
冭
冮
冯
冰
冱
冲
决
况
冶
冷
冺
冻
冽
净
凃
凄
准
凇
凈
凉
凊
凋
凌
凍
减
凑
凓
凔
凖
凘
凛
凜
凝
凟
几
凡
凢
凣
凤
処
凨
凫
凭
凯
凰
凱
凳
凴
凵
凶
凷
凸
凹
出
击
函
凾
凿
刀
刁
刂
刃
刄
刅
分
切
刈
刊
刋
刌
刍
刎
刐
刑
划
刕
刖
列
刘
则
刚
创
初
刟
删
判
別
刦
刧
刨
利
刪
别
刬
刭
刮
到
刲
刳
刴
制
刷
券
刹
刺
刻
刼
刽
剀
剁
剂
剃
剄
剅
則
剉
削
剋
剌
前
剎
剏
剐
剑
剒
剔
剕
剖
剗
剘
剙
剚
剛
剜
剝
剞
剟
剡
剣
剤
剥
剧
剩
剪
剮
副
割
剳
剴
創
剷
剸
剽
剿
劁
劂
劃
劄
劇
劈
劉
劊
劌
劍
劎
劑
劓
劔
劕
劗
劘
力
劝
办
功
加
务
劢
劣
劦
动
助
努
劫
劬
劭
励
劲
劳
労
劵
劸
効
劻
劼
劾
势
勁
勃
勄
勅
勇
勉
勋
勌
勍
勐
勑
勒
動
勖
勗
勘
務
勛
勜
勝
勞
募
勢
勣
勤
勦
勧
勨
勱
勳
勵
勸
勹
勺
勾
勿
匀
匃
包
匆
匈
匊
匋
匍
匏
匐
匕
化
北
匙
匚
匛
匜
匝
匠
匡
匣
匦
匧
匪
匬
匭
匮
匯
匱
匳
匴
匸
匹
区
医
匼
匽
匾
匿
區
十
卂
千
卄
卅
升
午
卉
半
卋
卌
华
协
卑
卒
卓
協
单
卖
南
単
博
卜
卞
占
卡
卢
卣
卤
卦
卧
卨
卩
卪
卫
卬
卭
卮
卯
印
危
卲
即
却
卵
卷
卸
卹
卺
卻
卽
卿
厂
厃
厄
厅
历
厈
厉
压
厌
厍
厎
厓
厔
厕
厖
厘
厙
厚
厛
厝
原
厠
厢
厤
厥
厦
厨
厩
厪
厫
厭
厮
厰
厲
厳
厶
厷
厸
去
厼
厽
县
叁
参
參
叄
叅
叆
叇
又
叉
及
友
双
反
収
发
叒
叔
叕
取
受
变
叙
叚
叛
叟
叠
叡
叢
口
古
句
另
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叵
叶
号
司
叹
叺
叻
叼
叽
叿
吀
吁
吂
吃
各
吅
吆
合
吉
吊
同
名
后
吏
吐
向
吒
吓
吔
吕
吗
吘
君
吜
吝
吞
吟
吠
吢
吣
否
吧
吨
吩
吪
含
听
吭
吮
启
吱
吲
吳
吴
吵
吶
吸
吹
吻
吼
吽
吾
吿
呀
呂
呃
呅
呆
呈
告
呋
呌
呎
呏
呐
呑
呓
呕
员
呙
呛
呜
呞
呠
呡
呢
呤
呥
呦
呧
周
呩
呪
呫
呭
呯
呱
呲
味
呴
呵
呶
呷
呸
呺
呻
呼
命
呾
呿
咀
咁
咂
咃
咄
咅
咆
咈
咋
和
咍
咎
咏
咐
咒
咔
咕
咖
咘
咙
咚
咛
咜
咝
咟
咠
咡
咢
咣
咤
咥
咦
咧
咨
咩
咪
咫
咬
咭
咮
咯
咱
咲
咳
咴
咵
咶
咷
咸
咹
咺
咻
咼
咽
咾
咿
哀
品
哂
哃
哄
哆
哇
哈
哉
响
哎
哏
哐
哑
哒
哓
哔
哕
哖
哗
哙
哜
哝
哞
哟
哠
員
哢
哣
哥
哦
哧
哨
哩
哪
哫
哬
哭
哮
哯
哰
哱
哲
哳
哴
哵
哹
哺
哼
哽
哾
哿
唀
唁
唂
唃
唄
唅
唆
唇
唈
唉
唋
唌
唎
唏
唐
唑
唒
唓
唔
唖
唚
唠
唡
唢
唤
唥
唧
唩
唪
唫
唬
唭
售
唯
唰
唱
唲
唳
唵
唶
唷
唸
唹
唻
唼
唾
唿
啀
啁
啂
啃
啄
啅
商
啇
啈
啉
啊
啌
問
啐
啑
啒
啓
啕
啖
啗
啚
啛
啜
啝
啞
啟
啡
啢
啣
啤
啥
啦
啧
啨
啩
啪
啫
啬
啮
啯
啰
啱
啲
啴
啶
啷
啸
啺
啻
啼
啾
啿
喀
喁
喂
喃
善
喇
喈
喉
喊
喋
喍
喎
喏
喐
喑
喒
喓
喔
喕
喘
喙
喚
喛
喜
喝
喞
喟
喠
喡
喤
喥
喦
喧
喨
喪
喫
喬
喭
單
喯
喱
喲
喳
喴
喵
喷
喹
喻
喼
喽
喿
嗂
嗃
嗄
嗅
嗆
嗇
嗉
嗊
嗌
嗍
嗎
嗑
嗒
嗓
嗔
嗕
嗖
嗗
嗘
嗙
嗚
嗛
嗜
嗝
嗞
嗟
嗡
嗢
嗣
嗤
嗥
嗦
嗨
嗩
嗫
嗭
嗯
嗵
嗶
嗷
嗹
嗺
嗼
嗽
嗾
嗿
嘀
嘁
嘅
嘆
嘇
嘈
嘉
嘋
嘍
嘎
嘏
嘑
嘒
嘓
嘔
嘕
嘖
嘗
嘘
嘛
嘜
嘝
嘞
嘟
嘡
嘩
嘪
嘫
嘬
嘭
嘮
嘯
嘰
嘱
嘲
嘴
嘵
嘶
嘷
嘸
嘹
嘺
嘻
嘼
嘽
嘾
嘿
噀
噁
噂
噃
噄
噅
噉
噋
噌
噍
噎
噏
噐
噒
噓
噔
噖
噗
噘
噙
噚
噛
噝
噞
噠
噡
噢
噣
噤
噥
噦
器
噩
噪
噫
噬
噭
噯
噱
噲
噴
噶
噷
噸
噼
噽
嚀
嚂
嚄
嚅
嚆
嚇
嚈
嚉
嚊
嚋
嚎
嚏
嚓
嚕
嚙
嚚
嚛
嚜
嚟
嚢
嚣
嚥
嚦
嚧
嚨
嚬
嚮
嚯
嚱
嚳
嚴
嚵
嚶
嚷
嚻
嚼
囀
囁
囂
囄
囈
囉
囊
囋
囌
囑
囒
囓
囔
囕
囗
囘
囙
囚
四
囝
回
囟
因
囡
团
囤
囫
囬
园
囮
囯
困
囱
囲
围
囵
囷
囹
固
囻
国
图
囿
圀
圂
圃
圄
圅
圆
圇
圈
圉
圊
國
圍
圎
園
圓
圖
圗
團
圚
圜
圝
圞
土
圡
圢
圣
圤
圥
圦
圧
在
圩
圪
圬
圭
圮
圯
地
圳
圹
场
圻
圼
圾
址
坂
坆
均
坉
坊
坋
坌
坍
坎
坏
坐
坑
坒
块
坚
坛
坜
坝
坞
坟
坠
坡
坢
坤
坥
坦
坧
坨
坩
坪
坫
坭
坯
坰
坱
坳
坴
坵
坷
坻
坼
坿
垀
垂
垃
垄
垆
垈
垉
型
垌
垒
垓
垔
垙
垚
垛
垜
垞
垠
垡
垢
垣
垤
垥
垦
垧
垨
垩
垫
垭
垮
垰
垱
垲
垴
垵
垹
垻
埁
埂
埃
埇
埈
埋
埌
城
埒
埔
埕
埙
埚
埜
埝
域
埠
埡
埣
埤
埧
埨
埩
埬
埭
埮
埯
埰
埲
埴
埵
埶
執
埸
培
基
埼
堂
堄
堅
堆
堇
堈
堉
堊
堋
堍
堎
堑
堒
堕
堗
堙
堛
堝
堞
堠
堡
堤
堦
堪
堭
堯
堰
報
場
堵
堷
堹
堿
塀
塂
塃
塄
塊
塋
塌
塍
塏
塑
塒
塔
塗
塘
塙
塚
塝
塞
塟
塢
塤
塩
填
塭
塲
塳
塵
塸
塹
塻
塼
塾
墀
墁
境
墅
墆
墉
墊
墒
墓
増
墙
墛
墜
墝
增
墟
墦
墨
墩
墫
墮
墱
墳
墶
墻
墼
墾
壁
壅
壇
壈
壉
壋
壌
壎
壐
壑
壓
壕
壘
壙
壚
壜
壝
壞
壟
壠
壢
壤
壨
壩
士
壬
壮
壯
声
売
壳
壴
壶
壷
壹
壺
壻
壼
壽
夂
夃
处
夅
夆
备
夈
夊
夋
夌
复
夏
夐
夕
外
夗
夘
夙
多
夛
夜
够
夠
夢
夣
夤
夥
夦
大
天
太
夫
夬
夭
央
夯
夰
失
夲
头
夶
夷
夸
夹
夺
夾
奁
奂
奄
奇
奈
奉
奋
奎
奏
奐
契
奔
奕
奖
套
奘
奚
奠
奡
奢
奣
奥
奧
奩
奪
奬
奭
奮
女
奴
奶
奸
她
奻
好
妁
如
妃
妄
妆
妇
妈
妊
妋
妍
妑
妒
妓
妖
妗
妙
妝
妞
妟
妠
妣
妤
妥
妨
妩
妪
妬
妮
妯
妲
妳
妸
妹
妻
妾
姁
姂
姅
姆
姈
姉
姊
始
姐
姑
姒
姓
委
姗
姘
姙
姚
姜
姝
姣
姤
姥
姦
姨
姪
姬
姮
姱
姸
姹
姻
姿
威
娃
娄
娅
娆
娇
娈
娉
娋
娌
娑
娒
娓
娕
娖
娘
娛
娜
娞
娟
娠
娣
娤
娥
娩
娪
娫
娬
娱
娲
娴
娶
娼
婀
婁
婄
婆
婇
婉
婊
婌
婍
婎
婓
婕
婚
婢
婥
婦
婪
婫
婬
婭
婴
婵
婶
婷
婹
婺
婻
婿
媄
媌
媍
媎
媏
媒
媚
媛
媟
媠
媢
媤
媧
媪
媮
媲
媳
媵
媷
媸
媻
媼
媽
媾
嫁
嫂
嫉
嫊
嫋
嫌
嫏
嫔
嫖
嫗
嫘
嫙
嫚
嫜
嫠
嫡
嫣
嫦
嫧
嫨
嫩
嫫
嫰
嫵
嫷
嫻
嫽
嬈
嬉
嬋
嬌
嬍
嬏
嬐
嬑
嬖
嬗
嬙
嬡
嬩
嬪
嬭
嬰
嬴
嬵
嬷
嬸
嬾
嬿
孀
孃
孌
子
孑
孒
孓
孔
孕
孖
字
存
孙
孚
孛
孜
孝
孟
季
孤
孥
学
孨
孩
孪
孫
孬
孰
孱
孳
孵
學
孺
孼
孽
孿
宀
宁
宂
它
宄
宅
宇
守
安
宋
完
宏
宐
宓
宕
宗
官
宙
定
宛
宜
宝
实
宠
审
客
宣
室
宥
宦
宨
宪
宫
宮
宰
宲
害
宴
宵
家
宸
容
宻
宼
宽
宾
宿
寀
寂
寃
寄
寅
密
寇
寉
寊
富
寍
寐
寒
寓
寔
寕
寗
寘
寝
寞
察
寠
寡
寢
寤
寥
實
寧
寨
審
寫
寬
寮
寰
寳
寵
寶
寸
对
寺
寻
导
寽
対
寿
封
尃
射
尅
将
將
專
尉
尊
尋
尌
對
導
小
少
尒
尓
尔
尕
尖
尗
尘
尙
尚
尛
尜
尝
尞
尟
尠
尢
尣
尤
尥
尧
尪
就
尲
尴
尶
尸
尹
尺
尻
尼
尽
尾
尿
局
屁
层
屃
居
屆
屈
屉
届
屋
屍
屎
屏
屐
屑
屓
展
屚
屜
属
屠
屡
屢
屣
層
履
屦
屧
屨
屩
屬
屭
屮
屯
屰
山
屵
屹
屺
屼
屿
岁
岂
岄
岅
岊
岋
岌
岐
岑
岔
岖
岗
岘
岙
岚
岛
岜
岝
岞
岡
岣
岦
岧
岩
岫
岬
岭
岱
岳
岵
岸
岹
峇
峋
峒
峔
峕
峗
峙
峝
峡
峤
峥
峦
峨
峩
峪
峫
峭
峯
峰
峴
島
峸
峺
峻
峽
峿
崆
崇
崊
崍
崎
崑
崒
崔
崕
崖
崗
崙
崚
崛
崞
崠
崢
崧
崩
崪
崭
崱
崴
崵
崽
嵀
嵁
嵃
嵇
嵈
嵋
嵌
嵎
嵐
嵒
嵗
嵡
嵣
嵨
嵩
嵬
嵮
嵯
嵱
嵻
嵿
嶂
嶄
嶇
嶋
嶑
嶒
嶓
嶕
嶗
嶘
嶙
嶚
嶟
嶠
嶢
嶤
嶧
嶩
嶪
嶫
嶮
嶰
嶲
嶴
嶷
嶸
嶺
嶼
嶽
巂
巄
巍
巒
巓
巔
巖
巛
巜
川
州
巠
巡
巢
巤
工
左
巧
巨
巩
巫
差
己
已
巳
巴
巵
巷
巸
巻
巽
巾
巿
帀
币
市
布
帅
帆
师
帋
希
帏
帐
帑
帒
帔
帕
帖
帘
帙
帚
帛
帜
帝
帡
帥
带
帧
帨
師
帬
席
帮
帰
帱
帳
帶
帷
常
帻
帼
帽
幀
幂
幃
幄
幅
幇
幌
幍
幔
幕
幗
幘
幙
幚
幛
幝
幞
幟
幡
幢
幣
幨
幪
幫
幬
干
平
年
幵
并
幷
幸
幹
幺
幻
幼
幽
幾
广
庀
庁
広
庄
庆
庇
庉
床
庋
序
庐
庑
庒
库
应
底
庖
店
庙
庚
府
庞
废
庠
庤
庥
度
座
庫
庭
庯
庳
庵
庶
康
庸
庹
庻
庽
庾
廁
廂
廈
廉
廊
廋
廌
廒
廓
廔
廕
廖
廙
廚
廛
廝
廟
廠
廡
廢
廣
廨
廩
廪
廬
廳
廴
廵
延
廷
廸
廹
建
廻
廼
廾
廿
开
弁
异
弃
弄
弇
弈
弊
弋
弌
弍
弎
式
弐
弑
弒
弓
弔
引
弗
弘
弛
弜
弝
弟
张
弥
弦
弧
弩
弭
弯
弱
張
強
弹
强
弼
彀
彂
彈
彊
彌
彎
彐
彑
归
当
彔
录
彖
彗
彘
彙
彚
彛
彜
彝
彡
形
彣
彤
彥
彦
彧
彩
彪
彫
彬
彭
彰
影
彳
彷
役
彻
彼
彾
彿
往
征
徂
徃
径
待
徇
很
徉
徊
律
後
徍
徎
徐
徑
徒
従
徔
徕
得
徘
徙
徜
從
徠
御
徤
徧
徨
復
循
徬
徭
微
徯
徳
徴
徵
德
徹
徼
徽
忂
心
忄
必
忆
忇
忈
忉
忊
忋
忌
忍
忎
忏
忐
忑
忒
忖
志
忘
忙
忝
忟
忠
忡
忣
忤
忧
忨
忪
快
忭
忮
忱
忳
忴
念
忸
忺
忻
忼
忽
忾
忿
怀
态
怂
怃
怄
怅
怆
怍
怎
怏
怑
怒
怓
怔
怕
怖
怗
怙
怛
怜
思
怞
怠
怡
急
怦
性
怨
怩
怪
怫
怮
怯
怱
怲
怳
怵
总
怼
怿
恁
恂
恃
恄
恅
恆
恇
恉
恊
恋
恍
恐
恑
恒
恓
恕
恖
恗
恙
恚
恜
恝
恟
恠
恡
恢
恣
恤
恥
恧
恨
恩
恪
恫
恬
恭
息
恰
恳
恶
恸
恹
恺
恻
恼
恾
恿
悁
悃
悄
悅
悇
悈
悉
悋
悌
悍
悑
悒
悓
悔
悖
悗
悚
悛
悜
悞
悟
悠
患
悤
悦
悧
您
悪
悬
悭
悯
悰
悱
悲
悴
悵
悶
悻
悼
悽
悾
惀
情
惆
惇
惊
惋
惍
惏
惑
惓
惔
惕
惗
惘
惚
惛
惜
惝
惞
惟
惠
惡
惢
惥
惦
惧
惨
惩
惫
惬
惭
惮
惯
惰
惱
想
惴
惵
惶
惷
惸
惹
惺
惻
惼
愀
愁
愆
愈
愉
愊
愋
愍
愎
意
愐
愔
愕
愖
愚
愛
愜
愞
感
愠
愣
愤
愦
愧
愨
愩
愫
愬
愴
愷
愻
愼
愽
愾
愿
慃
慄
慆
慇
慈
慊
態
慌
慍
慎
慑
慓
慔
慕
慘
慙
慚
慛
慜
慝
慟
慢
慣
慤
慥
慧
慨
慪
慫
慬
慮
慰
慱
慳
慴
慵
慶
慷
慻
慼
慾
憂
憇
憊
憍
憎
憐
憑
憒
憓
憔
憘
憚
憝
憞
憟
憢
憤
憦
憧
憨
憩
憪
憫
憬
憭
憮
憯
憲
憴
憶
憸
憹
憺
憼
憾
懂
懃
懇
懈
應
懊
懋
懌
懍
懑
懒
懓
懔
懕
懙
懜
懝
懞
懟
懢
懣
懦
懧
懨
懬
懮
懱
懲
懴
懵
懶
懷
懸
懺
懼
懽
懾
懿
戀
戅
戆
戇
戈
戉
戊
戋
戌
戍
戎
戏
成
我
戒
戔
戕
或
戗
战
戚
戛
戞
戟
戠
戡
戢
戤
戥
戦
戧
截
戬
戮
戯
戰
戱
戲
戳
戴
戶
户
戸
戽
戾
房
所
扁
扃
扄
扆
扇
扈
扉
手
扌
才
扎
扏
扐
扑
扒
打
扔
払
扖
扗
托
扙
扛
扜
扞
扠
扡
扢
扣
扦
执
扨
扩
扪
扫
扬
扭
扮
扯
扰
扱
扲
扳
扵
扶
批
扺
扼
扽
找
承
技
抃
抄
抅
抆
抇
抈
抉
把
抋
抌
抏
抐
抑
抒
抓
抔
投
抖
抗
折
抙
抚
抛
抜
抝
択
抟
抠
抡
抢
抣
护
报
抦
抧
抨
抩
抪
披
抬
抭
抯
抱
抲
抳
抴
抵
抶
抷
抸
抹
抺
抻
押
抽
抾
抿
拁
拂
拄
担
拆
拇
拈
拉
拊
拋
拌
拍
拎
拏
拐
拑
拒
拓
拔
拕
拖
拗
拘
拙
拚
招
拜
拝
拞
拟
拠
拡
拢
拣
拥
拦
拧
拨
择
拪
拫
括
拭
拮
拯
拰
拱
拲
拳
拴
拵
拶
拷
拸
拹
拻
拼
拽
拾
拿
持
挂
挃
挄
挅
指
挈
按
挌
挍
挎
挏
挑
挒
挓
挕
挖
挗
挙
挚
挛
挝
挞
挟
挠
挡
挢
挣
挤
挥
挦
挨
挪
挫
挬
挭
振
挰
挱
挲
挴
挵
挶
挷
挸
挹
挺
挼
挽
挾
挿
捁
捂
捃
捄
捅
捆
捇
捈
捉
捋
捌
捍
捎
捏
捐
捒
捔
捕
捖
捘
捙
捚
捛
捝
捞
损
捠
捡
换
捣
捤
捥
捦
捧
捨
捫
捭
据
捯
捰
捱
捲
捵
捶
捷
捹
捺
捻
捽
捾
捿
掀
掁
掂
掃
掄
掆
掇
授
掉
掊
掋
掌
掍
掎
掏
掐
掑
排
掕
掖
掘
掙
掛
掝
掠
採
探
掣
掤
接
控
推
掩
措
掬
掮
掯
掰
掱
掳
掴
掷
掸
掺
掼
掽
掾
掿
揀
揁
揂
揄
揆
揇
揉
揋
揌
揍
揎
描
提
揑
插
揔
揕
揖
揗
揙
揚
換
揜
揞
揟
揠
握
揢
揣
揦
揨
揩
揪
揬
揭
揮
揰
揲
揳
援
揵
揷
揸
揹
揽
揾
揿
搀
搁
搂
搅
搆
搇
搈
搉
搊
搌
損
搎
搏
搐
搒
搓
搔
搖
搗
搘
搙
搛
搜
搝
搞
搠
搡
搢
搣
搤
搥
搦
搧
搨
搩
搪
搬
搭
搮
搯
搰
搱
搳
搴
搵
搶
搷
搸
搹
携
搽
搾
摀
摁
摃
摄
摅
摆
摇
摈
摊
摌
摏
摐
摑
摒
摓
摔
摕
摖
摘
摙
摛
摜
摞
摟
摠
摡
摧
摨
摩
摪
摭
摯
摱
摳
摶
摷
摸
摹
摺
摻
摼
摽
摾
撁
撂
撅
撇
撈
撉
撊
撋
撌
撍
撎
撏
撐
撑
撒
撓
撔
撕
撘
撙
撚
撛
撜
撝
撞
撟
撢
撣
撤
撥
撦
撩
撫
撬
播
撮
撰
撲
撳
撴
撵
撷
撸
撺
撻
撼
撾
撿
擀
擁
擂
擃
擄
擅
擆
擇
擉
擊
擋
操
擎
擐
擒
擓
擔
擕
擗
擘
據
擛
擞
擟
擠
擡
擢
擣
擤
擥
擦
擧
擩
擬
擭
擯
擰
擱
擲
擴
擷
擸
擺
擻
擼
擾
擿
攀
攄
攅
攆
攉
攊
攎
攏
攑
攒
攔
攕
攘
攙
攛
攜
攝
攞
攡
攢
攣
攤
攩
攪
攫
攬
攭
攮
支
攲
攴
攵
收
攷
攸
改
攺
攻
攽
放
政
敁
敃
敄
故
效
敉
敌
敍
敎
敏
救
敔
敕
敖
敗
敘
教
敛
敝
敞
敠
敢
散
敦
敪
敫
敬
敭
敯
数
敲
整
敵
敶
敷
數
敺
敻
斁
斂
斃
斄
斅
文
斈
斉
斋
斌
斍
斎
斐
斑
斒
斓
斕
斗
料
斛
斜
斝
斟
斡
斤
斥
斧
斨
斩
斫
斬
断
斮
斯
新
斲
斳
斷
方
於
施
斿
旁
旂
旃
旄
旅
旆
旈
旉
旋
旌
旎
族
旐
旖
旗
旙
旛
无
旡
既
旣
日
旦
旧
旨
早
旬
旭
旮
旯
旰
旱
旲
旴
旵
时
旷
旸
旹
旺
旻
旼
昂
昃
昆
昇
昉
昊
昌
昍
明
昏
昑
易
昔
昕
昗
昙
昚
昛
昜
昝
昞
星
映
昤
春
昧
昨
昪
昫
昬
昭
是
昰
昱
昳
昴
昵
昶
昷
昹
昺
昼
昽
显
昿
晁
時
晃
晄
晅
晈
晉
晋
晌
晏
晐
晒
晓
晔
晕
晖
晚
晛
晝
晞
晟
晡
晢
晤
晥
晦
晨
晫
晬
晭
普
景
晰
晴
晶
晷
智
晾
暀
暂
暃
暄
暇
暈
暉
暊
暋
暌
暎
暏
暐
暑
暖
暗
暘
暛
暝
暠
暢
暦
暧
暨
暪
暫
暭
暮
暱
暴
暵
暶
暸
暹
暾
暿
曀
曁
曄
曅
曆
曇
曉
曊
曍
曎
曔
曖
曙
曚
曛
曜
曝
曠
曥
曦
曧
曨
曩
曬
曰
曲
曳
更
曵
曷
書
曹
曼
曽
曾
替
最
朁
朂
會
月
有
朋
服
朏
朐
朑
朒
朔
朕
朗
望
朝
朞
期
朠
朤
朦
朧
木
朩
未
末
本
札
朮
术
朱
朴
朵
朶
朷
机
朽
朾
朿
杀
杁
杂
权
杄
杅
杆
杇
杈
杉
杊
杋
杌
李
杏
材
村
杓
杕
杖
杙
杜
杞
束
杠
条
杣
来
杧
杨
杪
杭
杯
杰
東
杲
杳
杴
杵
杶
杷
杸
杺
杻
杼
松
板
极
构
枅
枇
枉
枊
枋
枌
枏
析
枒
枓
枕
林
枘
枚
枛
果
枝
枞
枢
枣
枪
枫
枭
枮
枯
枰
枲
枳
枵
架
枷
枸
枹
枺
枻
枼
柀
柁
柂
柃
柄
柅
柆
柈
柉
柊
柋
柏
某
柑
柒
染
柔
柘
柙
柚
柜
柝
柞
柟
柠
柢
柣
柤
查
柧
柨
柩
柪
柬
柮
柯
柰
柱
柳
柴
柵
柷
柸
柹
柺
柽
柾
柿
栀
栁
栂
栃
栅
标
栈
栉
栊
栋
栌
栍
栎
栏
栐
树
栓
栔
栖
栗
栘
栟
栠
校
栢
栣
栧
栩
株
栫
栰
栱
栲
栳
样
核
根
栻
格
栽
栾
桀
桁
桂
桃
桄
桅
框
案
桉
桋
桌
桎
桐
桑
桓
桔
桕
桗
桟
桠
桡
桢
档
桤
桥
桦
桧
桨
桩
桫
桬
桭
桮
桯
桱
桲
桴
桶
桷
桹
桻
桼
桿
梀
梁
梂
梃
梄
梅
梆
梇
梌
梏
梐
梒
梓
梔
梕
梖
梗
梘
梚
梛
條
梞
梟
梠
梢
梣
梦
梧
梨
梩
梪
梬
梭
梮
梯
械
梱
梳
梴
梵
梶
梹
梾
检
棁
棂
棃
棄
棆
棈
棉
棊
棋
棍
棐
棑
棒
棓
棕
棖
棗
棘
棚
棟
棠
棣
棥
棦
棧
棨
森
棯
棱
棲
棳
棵
棶
棹
棺
棻
棼
棿
椀
椁
椂
椄
椅
椆
椇
椈
椊
椌
植
椎
椏
椐
椑
椒
椓
椔
椖
椗
椙
椚
椟
椢
椣
椤
椥
椭
椰
椲
椳
椴
椶
椸
椹
椽
椾
椿
楀
楂
楃
楄
楆
楇
楊
楎
楏
楓
楔
楕
楙
楚
楛
楝
楞
楟
楠
楢
楣
楥
楦
楨
楩
楪
楫
楬
業
楮
楯
楱
楳
楴
極
楷
楸
楹
楼
楽
概
榄
榅
榆
榇
榈
榉
榑
榔
榕
榖
榘
榚
榛
榜
榞
榟
榡
榣
榦
榧
榨
榩
榪
榫
榭
榮
榱
榳
榴
榶
榷
榻
榼
榾
榿
槀
槁
槂
槃
槅
槇
槈
槊
構
槌
槍
槎
槏
槐
槑
槒
槓
槔
槕
槖
様
槛
槜
槞
槟
槢
槣
槧
槨
槩
槪
槭
槮
槯
槰
槲
槳
槶
槹
槺
槽
槾
槿
樁
樂
樅
樆
樊
樋
樌
樍
樑
樓
樔
樗
樘
標
樛
樝
樞
樟
模
樣
樤
樨
権
横
樭
樯
樱
樳
樵
樶
樷
樸
樹
樺
樻
樽
樾
樿
橄
橅
橇
橈
橉
橊
橋
橌
橏
橐
橑
橒
橔
橕
橘
橙
橛
橝
橞
機
橡
橢
橤
橦
橧
橫
橬
橯
橰
橱
橷
橹
橺
橼
橽
橾
橿
檀
檁
檂
檄
檇
檉
檊
檍
檎
檐
檑
檒
檔
檗
檚
檛
檜
檝
檠
檡
檢
檣
檤
檩
檪
檫
檬
檭
檮
檯
檰
檱
檳
檸
檺
檻
檽
櫂
櫃
櫅
櫆
櫈
櫉
櫊
櫍
櫓
櫗
櫚
櫛
櫝
櫞
櫟
櫢
櫥
櫧
櫨
櫩
櫪
櫬
櫳
櫴
櫶
櫸
櫺
櫻
欀
欄
權
欋
欏
欐
欒
欔
欖
欗
欛
欜
欝
欞
欠
次
欢
欣
欤
欥
欧
欬
欮
欱
欲
欵
欶
欷
欸
欹
欺
欻
欽
款
歃
歆
歇
歉
歌
歎
歐
歓
歔
歕
歙
歛
歟
歠
歡
止
正
此
步
武
歧
歨
歩
歪
歮
歯
歰
歱
歲
歳
歴
歷
歸
歹
歺
死
歼
歿
殀
殁
殂
殃
殄
殆
殇
殉
殊
残
殍
殑
殒
殓
殖
殘
殚
殛
殞
殡
殤
殨
殪
殫
殭
殮
殯
殲
殳
殴
段
殷
殸
殹
殺
殻
殼
殽
殿
毀
毁
毂
毅
毆
毈
毉
毋
毌
母
毎
每
毒
毓
比
毕
毖
毗
毘
毙
毚
毛
毡
毦
毧
毫
毬
毯
毳
毷
毽
氂
氄
氅
氈
氊
氍
氏
氐
民
氓
气
氕
気
氙
氚
氛
氡
氣
氤
氧
氨
氩
氫
氬
氭
氮
氯
氲
氳
水
氵
氷
永
氺
氻
氽
氾
氿
汀
汁
求
汆
汇
汉
汊
汌
汍
汎
汐
汒
汓
汔
汕
汗
汘
汙
汚
汛
汜
汝
汞
江
池
污
汤
汧
汨
汩
汪
汫
汭
汰
汲
汴
汵
汶
汹
決
汼
汽
汾
汿
沁
沂
沃
沆
沈
沉
沋
沌
沏
沐
沒
沓
沔
沕
沖
沗
沙
沚
沛
沝
沟
没
沥
沦
沧
沪
沫
沬
沭
沮
沱
沲
河
沴
沸
油
治
沼
沽
沾
沿
況
泃
泄
泅
泆
泇
泈
泉
泊
泌
泍
泏
泐
泑
泒
泓
泔
法
泖
泗
泙
泚
泛
泜
泝
泞
泟
泠
泡
波
泣
泥
注
泩
泪
泫
泮
泯
泰
泱
泳
泵
泷
泸
泺
泻
泼
泽
泾
泿
洁
洃
洄
洅
洇
洊
洋
洌
洎
洏
洐
洑
洒
洓
洗
洘
洙
洚
洛
洞
洟
洠
洡
洣
津
洧
洨
洩
洪
洫
洮
洰
洱
洲
洳
洴
洵
洶
洷
洸
活
洼
洽
派
洿
流
浃
浄
浅
浆
浇
浊
测
浍
济
浏
浑
浒
浓
浔
浖
浗
浘
浙
浚
浜
浞
浠
浡
浢
浣
浥
浦
浧
浩
浪
浬
浮
浯
浰
浱
浴
浶
海
浸
浹
浼
浽
浿
涂
涃
涅
涇
消
涉
涊
涌
涎
涒
涓
涔
涕
涖
涗
涘
涛
涝
涞
涟
涡
涣
涤
润
涧
涨
涩
涪
涮
涯
涱
液
涴
涵
涷
涸
涻
涼
涿
淀
淁
淂
淃
淄
淅
淆
淇
淊
淋
淌
淍
淎
淐
淑
淒
淖
淘
淙
淚
淛
淝
淞
淟
淡
淢
淤
淥
淦
淨
淩
淪
淫
淬
淮
淯
淰
深
淳
淵
淶
混
淹
淺
添
淼
渀
渁
渃
清
済
渉
渊
渍
渎
渐
渔
渖
渗
渙
渚
減
渝
渟
渠
渡
渣
渤
渥
渦
渧
渨
温
渫
測
渭
港
渰
渲
渴
游
渺
渼
渽
渾
湂
湃
湄
湅
湆
湈
湉
湊
湌
湍
湎
湏
湓
湔
湖
湘
湙
湛
湜
湞
湟
湡
湥
湧
湨
湩
湫
湮
湯
湲
湳
湴
湶
湼
湾
湿
溂
溃
溅
溇
溈
溉
溋
溎
溏
源
溒
溓
溕
準
溗
溘
溙
溚
溜
溝
溞
溟
溢
溤
溥
溦
溧
溨
溩
溪
溫
溯
溱
溲
溳
溴
溶
溷
溸
溺
溻
溼
溽
溿
滀
滁
滂
滃
滄
滅
滆
滇
滈
滋
滌
滏
滑
滓
滔
滕
滙
滚
滛
滝
滞
满
滢
滤
滥
滨
滩
滬
滯
滱
滲
滳
滴
滶
滷
滸
滻
滽
滾
滿
漁
漂
漆
漈
漉
漊
漏
漑
漒
漓
演
漕
漖
漗
漘
漚
漝
漠
漢
漣
漧
漨
漩
漪
漫
漬
漮
漯
漱
漲
漳
漴
漸
漼
漾
漿
潀
潁
潄
潆
潇
潐
潑
潓
潔
潗
潘
潙
潚
潛
潜
潝
潞
潟
潠
潡
潢
潤
潦
潨
潩
潭
潮
潯
潰
潴
潵
潶
潷
潹
潺
潻
潾
澀
澁
澂
澄
澆
澇
澈
澊
澌
澍
澎
澖
澗
澜
澟
澠
澡
澢
澣
澤
澦
澧
澪
澫
澭
澮
澱
澳
澹
澺
澼
澾
澿
激
濁
濂
濃
濄
濇
濈
濉
濊
濐
濒
濓
濔
濕
濘
濛
濞
濟
濠
濡
濤
濧
濫
濬
濮
濯
濱
濲
濵
濶
濺
濼
濾
瀂
瀆
瀉
瀋
瀎
瀏
瀐
瀑
瀓
瀕
瀘
瀚
瀛
瀜
瀝
瀟
瀠
瀣
瀧
瀨
瀰
瀲
瀵
瀶
瀸
瀹
瀻
瀾
灆
灈
灋
灌
灑
灕
灘
灝
灞
灟
灡
灢
灣
火
灬
灭
灯
灰
灲
灳
灴
灵
灶
灸
灺
灼
災
灾
灿
炀
炁
炅
炆
炉
炊
炌
炎
炏
炐
炒
炔
炕
炖
炘
炙
炜
炝
炟
炤
炥
炧
炩
炪
炫
炬
炭
炮
炯
炱
炲
炳
炵
炶
炷
炸
点
為
炼
炽
烀
烁
烂
烇
烈
烊
烏
烑
烕
烖
烘
烙
烛
烜
烝
烟
烣
烤
烦
烧
烨
烩
烫
烬
热
烯
烴
烷
烸
烹
烺
烽
焇
焉
焊
焌
焏
焐
焒
焓
焕
焖
焘
焙
焚
焜
焝
焞
焟
焠
無
焦
焩
焪
焫
焭
焮
焯
焰
焱
然
焾
煅
煇
煉
煊
煌
煎
煏
煑
煒
煖
煙
煚
煜
煞
煠
煢
煣
煤
煥
煦
照
煨
煩
煬
煮
煳
煴
煵
煸
煺
煽
煿
熂
熄
熅
熇
熊
熎
熏
熑
熒
熔
熖
熗
熘
熙
熚
熝
熟
熠
熣
熤
熨
熬
熯
熱
熲
熳
熵
熶
熷
熹
熺
熻
熾
燀
燁
燃
燄
燅
燈
燉
燎
燏
燐
燒
燓
燔
燕
燖
燙
燜
營
燠
燣
燥
燦
燧
燫
燬
燭
燮
燰
燴
燵
燶
燹
燻
燼
燾
燿
爁
爆
爉
爊
爌
爍
爏
爐
爕
爗
爙
爛
爥
爦
爨
爪
爫
爬
爭
爯
爰
爱
爲
爵
父
爷
爸
爹
爺
爻
爼
爽
爾
爿
牀
牁
牂
牅
牆
片
版
牋
牌
牍
牏
牐
牒
牓
牕
牖
牘
牙
牚
牛
牜
牝
牟
牠
牡
牢
牣
牤
牦
牧
物
牪
牮
牯
牲
牳
牴
牵
牸
特
牺
牼
牽
牾
牿
犀
犁
犂
犄
犇
犉
犊
犍
犎
犒
犖
犛
犝
犠
犢
犧
犬
犭
犮
犯
犰
状
犸
犹
犺
犾
狀
狂
狃
狄
狅
狊
狌
狍
狎
狐
狒
狓
狔
狗
狙
狞
狠
狡
狥
狨
狩
狪
狫
独
狭
狮
狯
狰
狱
狲
狴
狸
狹
狺
狻
狼
狽
狾
猂
猉
猊
猋
猍
猎
猑
猒
猓
猕
猖
猗
猘
猙
猚
猛
猜
猝
猢
猣
猥
猨
猩
猪
猫
猬
献
猱
猴
猶
猷
猸
猺
猻
猾
猿
獀
獁
獃
獄
獅
獉
獍
獎
獏
獐
獒
獓
獗
獘
獜
獠
獣
獨
獪
獬
獭
獰
獲
獴
獵
獷
獸
獹
獺
獻
獼
獽
獾
玁
玃
玄
玅
率
玉
玊
王
玍
玎
玒
玕
玖
玛
玟
玠
玡
玥
玦
玧
玨
玩
玫
玬
玮
环
现
玱
玲
玳
玶
玷
玺
玻
玾
玿
珀
珂
珅
珈
珉
珊
珍
珐
珑
珓
珔
珖
珘
珙
珝
珞
珠
珢
珣
珤
珥
珧
珩
珪
珫
班
珮
珵
珶
珹
珽
現
琁
球
琅
理
琇
琉
琊
琐
琖
琚
琛
琜
琠
琢
琤
琥
琦
琨
琪
琫
琬
琭
琮
琯
琰
琱
琳
琴
琵
琶
琹
琼
琿
瑀
瑁
瑄
瑇
瑉
瑋
瑍
瑏
瑓
瑕
瑗
瑙
瑚
瑛
瑜
瑞
瑟
瑠
瑡
瑢
瑣
瑤
瑨
瑩
瑪
瑭
瑯
瑰
瑱
瑲
瑳
瑶
瑼
瑾
璀
璃
璇
璉
璊
璋
璐
璖
璘
璙
璚
璜
璞
璟
璣
璤
璥
璧
璨
璫
環
璲
璵
璹
璺
璼
璽
璿
瓆
瓈
瓊
瓏
瓑
瓒
瓔
瓘
瓚
瓜
瓞
瓠
瓢
瓣
瓤
瓦
瓮
瓯
瓴
瓶
瓷
瓼
瓿
甁
甄
甆
甌
甍
甎
甑
甓
甕
甘
甚
甜
生
產
産
甤
甥
甦
用
甩
甪
甫
甬
甭
甯
田
由
甲
申
电
男
甸
甹
画
甾
甿
畀
畂
畅
畆
畊
畋
界
畎
畏
畐
畑
畔
畕
留
畚
畛
畜
畝
畟
畢
略
畦
畧
畨
番
畫
畬
畯
異
畱
畴
畵
當
畹
畺
畾
畿
疆
疇
疊
疋
疌
疍
疎
疏
疐
疑
疒
疓
疔
疖
疗
疙
疚
疝
疞
疟
疠
疡
疢
疣
疤
疥
疨
疪
疫
疬
疭
疮
疯
疰
疱
疲
疳
疴
疵
疸
疹
疺
疼
疽
疾
疿
痀
痁
痂
痃
痄
病
痆
症
痈
痉
痊
痌
痍
痒
痔
痕
痖
痗
痘
痙
痚
痛
痞
痠
痡
痢
痣
痦
痧
痨
痪
痫
痰
痱
痳
痴
痶
痷
痹
痺
痼
痿
瘀
瘁
瘂
瘅
瘈
瘉
瘊
瘋
瘌
瘍
瘐
瘓
瘖
瘗
瘘
瘛
瘝
瘞
瘟
瘠
瘡
瘢
瘤
瘥
瘦
瘧
瘨
瘩
瘪
瘫
瘭
瘰
瘲
瘳
瘴
瘵
瘸
瘺
瘻
瘼
瘾
瘿
癀
療
癃
癆
癇
癉
癋
癌
癍
癐
癒
癔
癕
癖
癘
癜
癞
癟
癡
癢
癣
癤
癥
癧
癩
癫
癬
癭
癮
癯
癰
癱
癲
癶
癸
登
發
白
百
皀
皁
皂
皃
的
皅
皆
皇
皈
皋
皎
皐
皑
皓
皕
皙
皚
皛
皜
皞
皤
皥
皦
皮
皰
皱
皲
皴
皷
皸
皺
皼
皿
盂
盃
盅
盆
盇
盈
益
盌
盍
盎
盏
盐
监
盒
盔
盖
盗
盘
盛
盜
盝
盞
盟
盡
監
盤
盥
盦
盧
盪
盬
目
盯
盲
直
相
盹
盻
盼
盾
省
眄
眇
眈
眉
眊
看
眍
眎
眓
眔
眘
眛
眜
眞
真
眠
眢
眣
眥
眦
眧
眨
眩
眪
眬
眭
眮
眯
眰
眵
眶
眷
眸
眺
眼
眽
眾
眿
着
睁
睇
睈
睏
睐
睑
睒
睕
睖
睘
睚
睛
睜
睞
睟
睠
睡
睢
督
睥
睦
睧
睨
睪
睫
睬
睱
睲
睶
睸
睹
睽
睾
睿
瞀
瞄
瞅
瞇
瞋
瞌
瞍
瞎
瞐
瞑
瞒
瞖
瞘
瞙
瞜
瞞
瞟
瞠
瞢
瞥
瞧
瞩
瞪
瞬
瞭
瞰
瞳
瞵
瞶
瞷
瞻
瞼
瞽
瞿
矅
矇
矊
矌
矍
矑
矓
矗
矙
矚
矛
矜
矞
矟
矢
矣
知
矦
矧
矩
矫
矬
短
矮
矯
石
矴
矶
矼
矽
矾
矿
码
砂
砇
砌
砍
砑
砒
研
砖
砗
砚
砛
砝
砟
砢
砣
砥
砦
砧
砪
砬
砭
砰
砲
砳
破
砵
砷
砸
砺
砻
砾
砿
础
硁
硃
硅
硇
硌
硍
硏
硐
硕
硜
硝
硨
硫
硬
硭
确
硯
硳
硶
硷
硼
碁
碇
碉
碌
碍
碎
碏
碑
碓
碔
碕
碗
碘
碜
碞
碟
碡
碣
碧
碨
碩
碪
碮
碰
碱
碳
碴
確
碻
碼
碾
磁
磄
磅
磆
磉
磊
磋
磐
磑
磓
磔
磕
磙
磚
磟
磢
磣
磧
磨
磩
磬
磮
磯
磲
磴
磷
磹
磺
磻
磽
磾
礁
礄
礆
礇
礌
礎
礒
礙
礤
礦
礩
礪
礫
礬
礮
礱
礴
礵
示
礻
礼
社
祀
祁
祇
祈
祉
祍
祏
祐
祓
祔
祕
祖
祗
祘
祚
祛
祜
祝
神
祟
祠
祥
祧
票
祫
祭
祯
祱
祷
祸
祺
祽
祿
禀
禁
禃
禄
禅
禋
禍
禎
福
禔
禖
禘
禛
禟
禡
禥
禦
禧
禩
禪
禫
禬
禭
禮
禰
禱
禳
禸
禹
禺
离
禽
禾
禿
秀
私
秃
秈
秉
秊
秋
秌
种
科
秒
秕
秖
秘
秜
秝
租
秣
秤
秥
秦
秧
秨
秩
秪
秫
秭
积
称
秱
秲
秷
秸
秹
移
秽
秾
稀
稅
稊
程
稍
税
稔
稗
稚
稜
稟
稠
稡
稣
稨
稬
稭
種
稱
稲
稳
稴
稷
稹
稻
稼
稽
稾
稿
穀
穅
穆
穇
穉
穊
穌
積
穎
穏
穗
穜
穠
穡
穢
穣
穤
穨
穩
穫
穭
穴
穵
究
穷
穸
穹
空
穼
穽
穿
窀
突
窃
窄
窅
窆
窈
窊
窍
窎
窑
窒
窓
窕
窖
窗
窘
窜
窝
窞
窟
窠
窥
窦
窨
窩
窪
窬
窮
窯
窰
窳
窵
窸
窺
窻
窾
窿
竃
竄
竅
竆
竇
竈
竊
立
竑
竒
竖
站
竚
竜
竝
竞
竟
章
竢
竣
童
竦
竪
竫
竭
端
競
竸
竹
竺
竻
竽
竾
竿
笀
笃
笄
笆
笈
笊
笋
笏
笑
笓
笔
笕
笘
笙
笛
笞
笟
笠
笣
笤
笥
符
笨
笪
笫
第
笭
笮
笯
笱
笳
笵
笶
笸
笺
笼
笿
筄
筅
筆
筇
等
筋
筌
筍
筏
筐
筑
筒
筓
答
策
筙
筚
筛
筝
筞
筠
筢
筣
筤
筥
筦
筩
筪
筭
筮
筯
筰
筲
筴
筵
筷
筹
签
简
箅
箇
箉
箋
箍
箎
箏
箒
箓
箔
箕
算
箚
箛
箜
箝
箟
箠
管
箤
箦
箧
箪
箫
箭
箱
箴
箷
箸
箺
箻
箼
箽
節
篁
篃
範
篆
篇
築
篊
篋
篌
篓
篖
篘
篙
篚
篛
篝
篠
篡
篤
篥
篦
篩
篪
篭
篮
篰
篱
篲
篳
篵
篷
篻
篾
簀
簇
簉
簋
簍
簑
簒
簖
簜
簝
簞
簟
簡
簣
簦
簧
簩
簪
簫
簬
簮
簴
簷
簸
簽
簾
簿
籀
籁
籂
籃
籇
籊
籌
籍
籐
籒
籔
籖
籙
籚
籜
籟
籠
籣
籤
籥
籩
籪
籬
籮
籲
米
籴
籸
籺
类
籼
籽
粃
粈
粉
粑
粒
粓
粕
粗
粘
粚
粜
粟
粠
粡
粢
粤
粥
粦
粧
粩
粪
粬
粮
粱
粲
粳
粵
粷
粹
粼
粽
精
粿
糁
糅
糆
糈
糊
糋
糍
糕
糖
糗
糙
糜
糝
糞
糟
糠
糢
糧
糨
糮
糯
糰
糲
糴
糵
糶
糸
糹
系
糾
糿
紀
紂
紃
約
紅
紆
紇
紈
紉
紊
紋
納
紏
紐
紓
純
紕
紗
紘
紙
級
紛
紜
紝
素
紡
索
紥
紦
紧
紨
紩
紫
紬
紮
累
細
紱
紲
紳
紴
紵
紷
紹
紺
紼
紿
絀
絁
終
絃
組
絅
絆
経
絍
絎
絏
結
絕
絖
絙
絛
絜
絞
絡
絢
絤
給
絨
絩
絪
絫
絬
絭
絮
絰
統
絲
絳
絵
絶
絷
絸
絹
絺
絻
綀
綁
綂
綃
綅
綆
綈
綉
綌
綍
綏
綑
經
綗
継
綛
綜
綠
綡
綢
綣
綦
綧
綨
綫
綬
維
綮
綰
綱
網
綳
綴
綵
綸
綹
綺
綻
綽
綾
綿
緀
緄
緅
緆
緇
緉
緊
緋
緍
総
緐
緑
緒
緓
緔
緗
緘
線
緜
緝
緞
緟
締
緡
緣
緤
緥
緦
緧
編
緩
緫
緬
緯
緲
練
緶
緹
緻
緼
縀
縁
縂
縄
縆
縈
縉
縊
縋
縍
縎
縐
縑
縒
縕
縗
縘
縚
縛
縝
縞
縟
縠
縢
縣
縦
縧
縫
縭
縮
縯
縱
縲
縳
縴
縶
縷
縸
縹
縺
縻
總
績
縿
繁
繂
繃
繄
繅
繆
繇
繋
繌
繏
繐
繒
繓
織
繕
繖
繘
繙
繚
繜
繞
繡
繦
繩
繪
繫
繭
繮
繰
繲
繳
繶
繸
繹
繼
繽
繾
纀
纂
纆
纇
纈
纊
續
纍
纏
纒
纓
纔
纖
纘
纙
纛
纟
纠
纡
红
纣
纤
纥
约
级
纨
纩
纪
纫
纬
纭
纯
纰
纱
纲
纳
纴
纵
纶
纷
纸
纹
纺
纻
纽
纾
线
绀
绁
练
组
绅
细
织
终
绉
绊
绋
绌
绍
绎
经
绐
绑
绒
结
绕
绗
绘
给
绚
绛
络
绝
绞
统
绢
绣
绥
绦
继
绩
绪
绫
续
绮
绯
绰
绳
维
绵
绶
绷
绸
综
绽
绿
缀
缁
缄
缅
缆
缉
缊
缋
缎
缏
缒
缓
缔
缕
编
缗
缘
缙
缚
缛
缜
缝
缠
缢
缣
缤
缥
缧
缨
缩
缪
缫
缭
缮
缯
缰
缱
缲
缴
缵
缶
缷
缸
缹
缺
缽
缾
罂
罃
罄
罅
罆
罈
罌
罍
罐
网
罒
罔
罕
罗
罘
罙
罚
罝
罟
罠
罡
罢
罣
罥
罨
罩
罪
罫
罭
置
罰
罱
署
罵
罷
罸
罹
罽
罾
羁
羅
羆
羈
羊
羋
羌
美
羔
羕
羗
羘
羙
羚
羝
羞
羡
羣
群
羨
義
羮
羯
羲
羴
羶
羸
羹
羽
羿
翀
翁
翄
翅
翊
翌
翎
翏
習
翔
翕
翘
翟
翠
翡
翥
翦
翩
翫
翬
翮
翰
翱
翳
翹
翺
翻
翼
耀
老
耂
考
耄
者
耆
耇
耈
耉
耋
而
耍
耎
耐
耑
耒
耔
耕
耗
耘
耙
耚
耜
耞
耡
耢
耤
耦
耧
耨
耬
耮
耰
耳
耴
耵
耶
耷
耸
耻
耼
耽
耿
聀
聂
聃
聆
聊
聋
职
聍
聎
聑
聒
联
聖
聘
聚
聝
聞
聩
聪
聫
聮
聯
聰
聱
聲
聳
聵
聶
職
聹
聽
聾
聿
肀
肃
肄
肅
肆
肇
肈
肉
肊
肋
肌
肐
肓
肔
肖
肗
肘
肙
肚
肛
肝
肠
股
肢
肣
肤
肥
肨
肩
肪
肫
肬
肭
肮
肯
肱
育
肴
肷
肸
肺
肽
肾
肿
胀
胁
胂
胃
胄
胆
胉
胊
胋
背
胎
胒
胖
胗
胘
胙
胚
胛
胜
胝
胞
胠
胡
胣
胤
胥
胧
胨
胪
胫
胭
胮
胯
胰
胱
胳
胴
胵
胶
胷
胸
胺
胼
能
胾
脂
脄
脅
脆
脇
脈
脉
脊
脍
脏
脐
脑
脓
脔
脖
脗
脘
脙
脚
脛
脝
脞
脢
脣
脤
脧
脩
脫
脬
脯
脰
脱
脳
脶
脸
脹
脺
脽
脾
脿
腀
腂
腆
腈
腊
腋
腌
腍
腎
腏
腐
腑
腒
腓
腔
腕
腖
腘
腚
腛
腜
腠
腡
腤
腥
腦
腧
腩
腫
腬
腭
腮
腯
腰
腱
腲
腳
腴
腸
腹
腺
腻
腼
腽
腾
腿
膀
膁
膂
膆
膈
膉
膊
膏
膑
膒
膓
膔
膕
膖
膘
膙
膚
膛
膜
膝
膞
膟
膠
膢
膣
膨
膩
膫
膮
膰
膲
膳
膶
膸
膺
膻
膽
膾
膿
臀
臁
臂
臃
臆
臈
臉
臊
臋
臌
臍
臏
臓
臕
臘
臙
臚
臛
臜
臝
臞
臟
臠
臡
臢
臣
臤
臥
臧
臨
自
臬
臭
臯
臱
至
致
臺
臻
臼
臽
臾
臿
舀
舁
舂
舄
舅
舆
與
興
舉
舊
舋
舌
舍
舎
舐
舒
舓
舔
舖
舘
舙
舚
舛
舜
舞
舟
舡
舢
舥
舨
舩
航
舫
般
舰
舱
舲
舳
舴
舵
舶
舷
舸
船
舻
艄
艅
艇
艋
艎
艔
艗
艘
艙
艚
艟
艢
艣
艤
艦
艨
艪
艫
艮
良
艰
艱
色
艳
艶
艷
艸
艹
艺
艻
艼
艽
艾
艿
芀
节
芃
芄
芆
芇
芈
芊
芋
芌
芍
芎
芑
芒
芔
芘
芙
芚
芛
芜
芝
芟
芠
芡
芣
芥
芦
芧
芨
芩
芪
芫
芬
芭
芮
芯
芰
花
芳
芷
芸
芹
芻
芼
芽
芾
芿
苇
苋
苍
苎
苏
苑
苒
苓
苔
苖
苗
苙
苚
苛
苜
苝
苞
苟
苡
苢
苣
苤
若
苦
苧
苩
苫
苭
英
苲
苳
苴
苶
苸
苹
苻
苽
苾
苿
茀
茁
茂
范
茄
茅
茆
茇
茈
茉
茌
茎
茏
茔
茕
茖
茗
茘
茙
茛
茜
茝
茟
茣
茤
茦
茧
茨
茩
茫
茬
茭
茯
茱
茲
茴
茵
茶
茸
茹
茺
茼
茾
荀
荂
荃
荄
荅
荆
荇
草
荊
荍
荎
荏
荐
荑
荒
荔
荕
荖
荗
荘
荚
荛
荞
荟
荠
荡
荣
荤
荦
荧
荨
荪
荫
荬
荭
药
荱
荲
荳
荷
荸
荻
荼
荽
莂
莄
莅
莆
莈
莉
莊
莍
莎
莐
莒
莓
莕
莖
莘
莚
莛
莜
莠
莢
莤
莧
莨
莩
莪
莫
莬
莭
莯
莰
莱
莲
莳
莴
莵
莶
获
莹
莺
莼
莽
莾
菀
菁
菂
菄
菅
菇
菉
菊
菌
菍
菏
菐
菑
菓
菔
菕
菖
菗
菘
菛
菜
菟
菠
菡
菢
菥
菩
菪
菫
菬
菭
華
菰
菱
菲
菴
菶
菷
菸
菹
菻
菼
菽
菾
萁
萃
萄
萆
萇
萈
萉
萊
萋
萌
萍
萎
萏
萑
萓
萗
萘
萙
萚
萝
萡
萤
营
萦
萧
萨
萩
萫
萬
萭
萮
萱
萵
萶
萸
萹
萻
萼
落
萾
葁
葅
葆
葇
葉
葎
葐
葑
葒
葓
葖
著
葙
葚
葛
葠
葡
董
葦
葧
葩
葫
葬
葭
葯
葱
葳
葴
葵
葶
葷
葸
葹
葺
葻
葽
葿
蒀
蒂
蒄
蒇
蒉
蒋
蒌
蒐
蒓
蒔
蒙
蒜
蒞
蒠
蒡
蒢
蒣
蒥
蒦
蒨
蒭
蒯
蒲
蒳
蒴
蒸
蒺
蒻
蒼
蒾
蒿
蓀
蓁
蓃
蓄
蓆
蓇
蓉
蓊
蓋
蓍
蓏
蓐
蓑
蓓
蓖
蓗
蓝
蓠
蓡
蓢
蓦
蓧
蓩
蓬
蓮
蓯
蓰
蓲
蓴
蓷
蓸
蓻
蓼
蓽
蓿
蔀
蔂
蔆
蔇
蔊
蔌
蔑
蔓
蔔
蔕
蔗
蔘
蔚
蔛
蔞
蔟
蔠
蔡
蔣
蔥
蔩
蔫
蔬
蔭
蔴
蔵
蔺
蔻
蔼
蔽
蔾
蕁
蕂
蕃
蕄
蕆
蕇
蕈
蕉
蕊
蕋
蕎
蕑
蕒
蕓
蕕
蕖
蕗
蕘
蕙
蕝
蕞
蕡
蕢
蕤
蕦
蕧
蕨
蕩
蕪
蕫
蕭
蕯
蕰
蕳
蕴
蕷
蕹
蕽
蕾
薀
薄
薆
薇
薈
薊
薏
薐
薑
薔
薕
薙
薛
薜
薝
薞
薟
薡
薤
薦
薨
薩
薪
薬
薮
薯
薰
薱
薳
薴
薷
薸
薹
薺
薼
薿
藁
藉
藊
藍
藎
藏
藐
藑
藓
藕
藖
藜
藝
藞
藟
藣
藤
藥
藦
藩
藪
藭
藲
藴
藶
藷
藹
藺
藻
藼
藾
藿
蘀
蘂
蘃
蘅
蘆
蘇
蘈
蘊
蘋
蘐
蘑
蘓
蘔
蘖
蘗
蘘
蘚
蘝
蘞
蘢
蘧
蘩
蘭
蘶
蘸
蘺
蘼
蘾
蘿
虀
虂
虅
虆
虉
虌
虍
虎
虏
虐
虑
虒
虓
虔
處
虖
虘
虚
虛
虜
虞
號
虡
虢
虧
虫
虬
虭
虮
虯
虱
虵
虶
虸
虹
虺
虻
虽
虾
蚀
蚁
蚂
蚅
蚆
蚊
蚋
蚌
蚍
蚎
蚓
蚕
蚖
蚗
蚘
蚜
蚝
蚣
蚤
蚧
蚨
蚩
蚪
蚫
蚬
蚭
蚯
蚰
蚱
蚳
蚵
蚶
蚺
蚼
蚽
蚾
蛀
蛁
蛄
蛆
蛇
蛉
蛊
蛋
蛌
蛎
蛐
蛑
蛒
蛔
蛘
蛙
蛚
蛛
蛞
蛟
蛣
蛤
蛥
蛦
蛩
蛫
蛭
蛮
蛰
蛳
蛴
蛹
蛻
蛽
蛾
蜀
蜂
蜃
蜄
蜅
蜆
蜇
蜈
蜉
蜊
蜋
蜍
蜐
蜒
蜓
蜗
蜘
蜙
蜚
蜜
蜞
蜡
蜢
蜣
蜥
蜦
蜨
蜩
蜮
蜯
蜰
蜱
蜳
蜴
蜷
蜺
蜻
蜼
蜾
蜿
蝀
蝃
蝇
蝈
蝉
蝌
蝎
蝐
蝒
蝓
蝔
蝕
蝗
蝘
蝙
蝞
蝟
蝠
蝡
蝢
蝣
蝤
蝥
蝦
蝧
蝨
蝩
蝮
蝰
蝱
蝲
蝳
蝴
蝶
蝸
蝻
蝼
蝾
蝿
螂
螃
螄
螅
螈
螉
螋
融
螓
螘
螙
螞
螟
螠
螢
螣
螦
螨
螫
螬
螭
螮
螯
螳
螺
螻
螽
蟀
蟄
蟆
蟈
蟊
蟋
蟎
蟑
蟒
蟚
蟛
蟟
蟠
蟡
蟣
蟥
蟨
蟪
蟬
蟮
蟯
蟲
蟳
蟵
蟶
蟷
蟹
蟺
蟻
蟾
蠃
蠄
蠅
蠆
蠊
蠋
蠍
蠎
蠏
蠐
蠑
蠒
蠓
蠔
蠕
蠖
蠙
蠛
蠟
蠡
蠢
蠣
蠪
蠬
蠭
蠱
蠲
蠶
蠷
蠹
蠻
蠼
蠾
血
衂
衄
衅
衆
衇
衊
行
衍
衒
術
衔
衕
衖
街
衘
衙
衚
衛
衝
衞
衡
衢
衣
衤
补
表
衩
衫
衬
衮
衰
衱
衲
衴
衶
衷
衹
衺
衽
衾
衿
袁
袂
袄
袅
袈
袊
袋
袌
袍
袏
袑
袒
袖
袗
袙
袜
袞
袠
袢
袤
袩
袪
被
袭
袮
袱
袴
袵
袷
裀
裁
裂
裃
装
裆
裈
裊
裌
裎
裏
裒
裔
裕
裘
裙
補
裝
裟
裡
裢
裤
裨
裩
裯
裱
裳
裴
裸
裹
裺
裼
製
裾
褀
褂
複
褊
褌
褎
褐
褒
褓
褙
褚
褛
褠
褡
褣
褥
褨
褪
褫
褮
褰
褱
褲
褳
褴
褶
褸
褻
襀
襁
襂
襃
襄
襆
襇
襊
襌
襍
襎
襕
襖
襘
襛
襜
襟
襠
襤
襥
襦
襨
襪
襬
襯
襲
襵
襻
襾
西
覀
要
覃
覆
覇
覈
覊
見
覌
規
覓
覔
視
覘
覚
覞
覡
覥
覦
覧
覩
親
覬
覯
覰
覲
覵
覷
覸
覺
覽
覿
觀
见
观
规
觅
视
觇
览
觉
觋
觍
觏
觐
觑
角
觔
觕
觖
觚
觜
觝
觞
觟
觡
解
觥
触
觧
觫
觳
觴
觸
言
訁
訂
訃
訇
計
訊
訌
討
訏
訐
訒
訓
訔
訕
訖
託
記
訛
訝
訟
訢
訣
訥
訩
訪
設
訰
許
訴
訶
診
註
証
訾
詁
詆
詈
詎
詐
詑
詔
評
詖
詘
詛
詝
詞
詠
詡
詢
詣
試
詧
詩
詫
詬
詭
詮
詰
話
該
詳
詵
詸
詹
詼
詾
詿
誄
誅
誇
誉
誊
誌
認
誎
誑
誒
誓
誔
誕
誘
誚
語
誠
誡
誣
誤
誥
誦
誧
誨
誩
說
説
読
誰
課
誶
誹
誼
誽
調
諂
諄
談
諉
請
諌
諍
諏
諑
諒
諕
論
諗
諛
諜
諝
諞
諠
諡
諢
諤
諦
諧
諪
諫
諭
諮
諱
諳
諶
諷
諸
諺
諼
諾
謀
謁
謂
謄
謅
謇
謊
謎
謏
謐
謔
謖
謗
謙
謚
講
謝
謟
謠
謢
謦
謨
謫
謬
謭
謳
謹
謼
謾
謿
譁
證
譌
譎
譏
譓
譔
譖
識
譙
譚
譛
譜
譟
警
譨
譫
譬
譭
譯
議
譱
譲
譴
譶
護
譸
譽
譾
讀
讁
讃
讅
變
讋
讌
讎
讐
讒
讓
讕
讖
讙
讚
讛
讜
讞
讟
讠
计
订
讣
认
讥
讦
讧
讨
让
讪
讫
训
议
讯
记
讲
讳
讴
讵
讶
讷
许
讹
论
讻
讼
讽
设
访
诀
证
诃
评
诅
识
诈
诉
诊
诋
诌
词
诎
诏
译
试
诖
诗
诘
诙
诚
诛
话
诞
诟
诠
诡
询
诣
诤
该
详
诧
诨
诩
诫
诬
语
诮
误
诰
诱
诲
说
诵
请
诸
诹
诺
读
诼
诽
课
谀
谁
谂
调
谄
谅
谆
谇
谈
谊
谋
谌
谍
谏
谐
谑
谒
谓
谕
谖
谗
谙
谚
谛
谜
谝
谞
谟
谠
谡
谢
谣
谤
谥
谦
谧
谨
谩
谪
谬
谮
谯
谰
谱
谲
谳
谴
谵
谶
谷
谺
谼
谾
谿
豁
豆
豇
豈
豉
豊
豌
豎
豐
豔
豕
豖
豗
豙
豚
豝
象
豢
豤
豦
豨
豩
豪
豫
豬
豭
豯
豳
豸
豹
豺
貂
貅
貇
貉
貊
貌
貍
貓
貔
貘
貛
貝
貞
貟
負
財
貢
貤
貧
貨
販
貪
貫
責
貭
貮
貯
貰
貲
貳
貴
貶
買
貸
貺
費
貼
貽
貿
賀
賁
賂
賃
賄
賅
資
賈
賉
賊
賍
賎
賏
賑
賒
賓
賔
賕
賖
賙
賚
賛
賜
賞
賠
賡
賢
賣
賤
賥
賦
質
賫
賬
賭
賴
賵
賸
賺
賻
購
賽
賾
贄
贅
贆
贇
贈
贊
贋
贍
贏
贐
贑
贒
贓
贔
贖
贗
贛
贝
贞
负
贡
财
责
贤
败
货
质
贩
贪
贫
贬
购
贮
贯
贰
贱
贲
贳
贴
贵
贶
贷
贸
费
贺
贼
贽
贾
贿
赀
赁
赂
赃
资
赅
赈
赉
赊
赋
赌
赎
赏
赐
赔
赖
赗
赙
赚
赛
赜
赝
赞
赠
赡
赢
赣
赤
赦
赧
赪
赫
赬
赭
走
赱
赳
赴
赵
赶
起
赸
赾
趁
趂
趄
超
越
趋
趍
趐
趑
趔
趕
趙
趟
趠
趣
趦
趨
趯
趱
趲
足
趴
趶
趷
趸
趺
趼
趾
趿
跀
跁
跂
跃
跄
跅
跋
跌
跎
跏
跐
跑
跒
跕
跖
跗
跙
跚
跛
距
跞
跟
跡
跢
跣
跤
跥
跧
跨
跩
跪
跫
跬
跭
跮
路
跱
跲
跳
跴
践
跷
跸
跹
跺
跻
跼
跽
跿
踁
踆
踈
踉
踊
踋
踌
踏
踐
踒
踔
踖
踘
踚
踝
踞
踟
踡
踢
踣
踤
踦
踧
踩
踪
踬
踭
踮
踯
踰
踱
踴
踵
踷
踸
踹
踽
踾
蹀
蹁
蹂
蹄
蹅
蹆
蹇
蹈
蹉
蹊
蹋
蹌
蹍
蹎
蹏
蹐
蹓
蹔
蹕
蹖
蹗
蹙
蹚
蹛
蹜
蹟
蹠
蹢
蹤
蹥
蹦
蹩
蹫
蹬
蹭
蹯
蹰
蹲
蹴
蹶
蹷
蹸
蹺
蹻
蹼
蹽
蹾
躁
躂
躃
躄
躅
躇
躉
躊
躋
躍
躎
躐
躑
躒
躓
躔
躕
躘
躙
躚
躜
躝
躡
躥
躦
躪
身
躬
躭
躯
躰
躱
躲
躶
躺
軀
軄
車
軋
軌
軍
軏
軐
軑
軒
軔
軗
軛
軟
軪
軫
軰
軲
軸
軺
軻
軼
軽
軾
軿
較
輅
載
輊
輍
輑
輒
輓
輔
輕
輗
輘
輙
輛
輜
輝
輞
輟
輦
輩
輪
輭
輮
輯
輳
輶
輸
輻
輼
輾
輿
轂
轄
轅
轆
轇
轉
轍
轎
轒
轔
轕
轘
轝
轟
轡
轢
轤
车
轧
轨
轩
转
轮
软
轰
轱
轲
轳
轴
轶
轸
轹
轻
载
轾
轿
较
辄
辅
辆
辇
辈
辉
辋
辍
辎
辏
辐
辑
输
辔
辕
辖
辗
辘
辙
辚
辛
辜
辝
辞
辟
辠
辢
辣
辤
辦
辨
辩
辭
辮
辯
辰
辱
農
辵
辶
边
辺
辻
込
辽
达
迁
迂
迄
迅
迆
过
迈
迊
迍
迎
运
近
迓
返
迕
还
这
进
远
违
连
迟
迡
迢
迤
迥
迦
迨
迩
迪
迫
迭
迯
述
迲
迴
迶
迷
迸
迹
迺
迻
追
迾
退
送
适
逃
逄
逅
逆
逈
选
逊
逋
逍
逎
透
逐
逑
递
逓
途
逕
逖
逗
這
通
逛
逝
逞
速
造
逡
逢
連
逦
逧
逨
逩
逭
逮
逰
週
進
逳
逴
逵
逶
逷
逸
逹
逺
逻
逼
逽
逾
遀
遁
遂
遃
遄
遅
遇
遊
運
遍
過
遏
遐
遑
遒
道
達
違
遗
遘
遙
遛
遜
遝
遞
遠
遡
遢
遣
遥
遨
適
遭
遮
遯
遲
遴
遵
遶
遷
選
遹
遺
遼
遽
避
邀
邁
邂
邃
還
邅
邇
邈
邉
邊
邋
邏
邐
邑
邒
邓
邕
邙
邛
邝
邞
邟
邠
邢
那
邤
邦
邨
邪
邮
邯
邰
邱
邳
邴
邵
邸
邹
邻
邼
邾
郁
郅
郇
郊
郋
郎
郑
郕
郖
郛
郜
郝
郟
郡
郢
郣
郤
部
郪
郭
郲
郵
郸
都
郾
郿
鄂
鄅
鄉
鄌
鄐
鄑
鄒
鄔
鄕
鄗
鄘
鄙
鄚
鄛
鄝
鄠
鄢
鄧
鄩
鄫
鄭
鄰
鄱
鄲
鄹
鄺
酀
酆
酉
酊
酋
酌
配
酒
酕
酖
酗
酚
酝
酟
酡
酢
酣
酥
酧
酩
酪
酬
酯
酱
酲
酴
酵
酶
酷
酸
酹
酺
酿
醀
醃
醅
醇
醉
醊
醋
醍
醎
醐
醒
醖
醚
醛
醜
醝
醞
醡
醢
醣
醪
醫
醬
醭
醮
醯
醲
醴
醶
醺
醻
醼
醾
醿
釀
釁
釅
釆
采
釉
释
釋
里
重
野
量
釐
金
釒
釓
釔
釕
釖
釗
釘
釙
釛
釜
針
釞
釟
釣
釦
釧
釩
釪
釫
釬
釭
釯
釰
釲
釵
釷
釹
釺
釼
釿
鈀
鈁
鈂
鈄
鈅
鈆
鈇
鈈
鈉
鈌
鈍
鈎
鈐
鈑
鈒
鈔
鈕
鈘
鈙
鈞
鈡
鈢
鈣
鈥
鈦
鈧
鈫
鈬
鈮
鈰
鈴
鈵
鈷
鈸
鈹
鈺
鈼
鈽
鈾
鈿
鉀
鉃
鉄
鉅
鉆
鉈
鉉
鉊
鉋
鉍
鉎
鉏
鉑
鉕
鉖
鉗
鉚
鉛
鉞
鉡
鉢
鉤
鉥
鉦
鉬
鉭
鉱
鉳
鉴
鉶
鉷
鉸
鉺
鉻
鉼
鉿
銀
銃
銅
銇
銊
銋
銍
銑
銓
銕
銖
銘
銙
銚
銛
銜
銠
銣
銥
銦
銨
銩
銪
銫
銬
銭
銮
銱
銲
銳
銶
銷
銹
銻
銼
銾
鋁
鋂
鋃
鋅
鋇
鋉
鋌
鋏
鋑
鋒
鋖
鋜
鋞
鋟
鋡
鋣
鋤
鋥
鋦
鋧
鋨
鋩
鋪
鋭
鋯
鋰
鋱
鋲
鋳
鋸
鋹
鋻
鋼
鋾
鋿
錁
錄
錆
錇
錋
錏
錐
錒
錘
錙
錚
錛
錝
錞
錟
錠
錡
錢
錦
錨
錩
錫
錮
錯
録
錳
錶
錸
錾
錿
鍀
鍁
鍂
鍄
鍆
鍉
鍊
鍋
鍍
鍐
鍔
鍘
鍙
鍚
鍛
鍝
鍞
鍡
鍤
鍥
鍩
鍪
鍬
鍮
鍰
鍱
鍳
鍵
鍶
鍺
鍼
鍽
鍾
鎁
鎂
鎄
鎇
鎊
鎋
鎌
鎏
鎒
鎔
鎖
鎗
鎘
鎚
鎛
鎡
鎢
鎣
鎦
鎧
鎩
鎫
鎬
鎭
鎮
鎯
鎰
鎳
鎵
鎶
鎷
鎸
鎻
鎿
鏁
鏂
鏃
鏇
鏈
鏌
鏍
鏏
鏐
鏑
鏓
鏕
鏖
鏗
鏘
鏙
鏜
鏝
鏞
鏟
鏡
鏢
鏣
鏤
鏦
鏨
鏰
鏳
鏵
鏷
鏹
鏺
鏽
鐃
鐄
鐈
鐋
鐏
鐐
鐒
鐔
鐖
鐘
鐙
鐛
鐝
鐟
鐠
鐡
鐣
鐦
鐨
鐫
鐮
鐯
鐰
鐱
鐲
鐳
鐵
鐶
鐷
鐸
鐺
鐻
鐿
鑁
鑄
鑅
鑆
鑊
鑌
鑑
鑒
鑔
鑕
鑚
鑛
鑞
鑟
鑠
鑡
鑢
鑣
鑤
鑥
鑧
鑨
鑪
鑫
鑬
鑭
鑰
鑱
鑲
鑵
鑷
鑹
鑼
鑽
鑾
鑿
钁
钅
钆
钇
针
钉
钊
钋
钌
钍
钎
钏
钒
钓
钔
钕
钖
钗
钘
钙
钚
钛
钜
钝
钞
钟
钠
钡
钢
钣
钤
钥
钦
钧
钨
钩
钪
钫
钬
钯
钱
钲
钴
钵
钷
钻
钼
钽
钾
钿
铀
铁
铂
铃
铄
铅
铆
铈
铉
铊
铋
铌
铎
铐
铑
铒
铕
铗
铙
铛
铜
铝
铟
铠
铡
铢
铣
铥
铦
铧
铨
铪
铫
铬
铭
铮
铰
铱
铲
铳
铵
银
铸
铹
铺
铼
铽
链
铿
销
锁
锂
锄
锅
锆
锇
锈
锉
锋
锌
锎
锐
锑
锒
锓
锔
锕
锗
锘
错
锚
锛
锝
锞
锡
锢
锣
锤
锥
锦
锧
锨
锫
锬
锭
键
锯
锲
锵
锶
锷
锸
锺
锻
锿
镀
镁
镂
镄
镅
镇
镈
镉
镊
镌
镍
镎
镏
镐
镑
镒
镓
镔
镖
镗
镘
镛
镜
镝
镞
镟
镣
镤
镥
镧
镨
镩
镪
镫
镬
镭
镯
镰
镱
镲
镳
镴
镵
镶
長
镸
长
門
閂
閃
閉
閊
開
閍
閎
閏
閑
閒
間
閔
閗
閘
閙
閟
閠
関
閣
閤
閥
閧
閨
閩
閫
閬
閭
閱
閲
閵
閹
閻
閼
閽
閾
闃
闇
闈
闉
闊
闋
闌
闍
闐
闒
闓
闔
闕
闖
闗
闘
闚
闛
關
闝
闞
闡
闢
闥
门
闩
闪
闭
问
闯
闰
闱
闲
间
闵
闷
闹
闺
闻
闼
闽
闾
阀
阁
阃
阄
阅
阇
阉
阍
阎
阏
阐
阑
阒
阔
阕
阙
阜
阝
阞
队
阡
阥
阦
阧
阨
阪
阬
阭
阮
阯
阱
防
阳
阴
阵
阶
阻
阼
阽
阿
陀
陂
附
际
陆
陇
陈
陋
陌
降
陏
限
陔
陕
陗
陘
陛
陜
陝
陞
陟
陡
院
陣
除
陨
险
陪
陬
陰
陲
陳
陵
陶
陷
陸
陻
陽
陿
隀
隂
隃
隄
隅
隆
隈
隉
隊
隋
隍
階
随
隐
隔
隕
隖
隗
隘
隙
際
障
隠
隡
隣
隤
隧
隨
隩
險
隰
隱
隲
隴
隶
隷
隸
隹
隺
隻
隼
隽
难
雀
雁
雂
雄
雅
集
雇
雉
雋
雌
雍
雎
雏
雐
雒
雔
雕
雖
雙
雚
雛
雜
雝
雞
離
難
雥
雨
雩
雪
雫
雬
雯
雰
雱
雲
雳
雴
零
雷
雹
電
雾
需
霁
霂
霄
霆
震
霈
霉
霍
霎
霏
霑
霓
霖
霜
霞
霟
霡
霤
霧
霪
霫
霭
霮
霯
霰
露
霳
霸
霹
霽
霾
靀
靂
靄
靆
靈
靉
靑
青
靓
靖
静
靚
靛
靜
靝
非
靠
靡
面
靣
靥
靨
革
靪
靫
靭
靰
靳
靴
靶
靼
靿
鞀
鞁
鞄
鞅
鞉
鞋
鞌
鞍
鞏
鞑
鞕
鞗
鞘
鞚
鞝
鞠
鞡
鞢
鞣
鞦
鞧
鞨
鞫
鞬
鞭
鞮
鞲
鞴
鞵
鞸
鞻
鞽
鞾
韁
韂
韃
韆
韈
韋
韌
韓
韙
韛
韜
韞
韤
韦
韧
韩
韪
韬
韭
韮
韯
韱
韲
音
韵
韶
韻
響
頁
頂
頃
項
順
頇
須
頊
頌
頎
頏
預
頑
頒
頓
頔
頗
領
頜
頞
頟
頠
頡
頢
頤
頦
頫
頬
頭
頮
頰
頲
頴
頷
頸
頹
頺
頻
頼
頽
顆
顇
顉
顋
題
額
顎
顏
顒
顓
顔
顕
顖
願
顙
顚
顛
類
顢
顥
顦
顧
顫
顬
顯
顰
顱
顳
顴
页
顶
顷
顸
项
顺
须
顼
顽
顾
顿
颁
颂
预
颅
领
颇
颈
颉
颊
颌
颏
颐
频
颓
颔
颖
颗
题
颙
颛
颜
额
颞
颟
颠
颡
颣
颤
颥
颦
颧
風
颯
颶
颺
颼
颿
飃
飄
飆
飍
风
飒
飘
飙
飛
飜
飞
食
飠
飡
飢
飣
飧
飨
飩
飪
飫
飭
飯
飱
飲
飴
飼
飽
飾
飿
餁
餂
餃
餄
餅
餈
餉
養
餌
餍
餐
餑
餒
餓
餔
餕
餖
餘
餚
餛
餞
餡
餧
館
餬
餮
餱
餲
餳
餵
餶
餷
餹
餻
餽
餾
餿
饃
饅
饈
饉
饋
饌
饍
饐
饑
饒
饔
饕
饗
饘
饜
饝
饞
饟
饢
饣
饤
饥
饧
饨
饪
饫
饬
饭
饮
饯
饰
饱
饲
饴
饵
饶
饷
饸
饺
饼
饽
饾
饿
馁
馂
馄
馅
馆
馇
馈
馊
馋
馍
馏
馐
馑
馒
馔
首
馗
馘
香
馤
馥
馨
馫
馬
馭
馮
馱
馳
馴
馹
馿
駁
駃
駈
駏
駐
駑
駒
駔
駕
駘
駙
駛
駝
駟
駡
駢
駦
駪
駭
駮
駱
駸
駽
駿
騁
騂
騃
騅
騈
騌
騍
騎
騏
騐
騖
騙
騝
騡
騣
騤
騧
騫
騬
騭
騮
騰
騳
騶
騷
騸
騼
騾
驀
驁
驃
驄
驅
驉
驊
驌
驍
驕
驗
驘
驚
驛
驟
驢
驤
驥
驩
驪
驫
马
驭
驮
驯
驰
驱
驳
驴
驵
驶
驷
驸
驺
驻
驼
驽
驾
驿
骀
骁
骂
骄
骅
骇
骈
骊
骋
验
骎
骏
骐
骑
骒
骕
骗
骚
骛
骞
骟
骠
骡
骤
骥
骧
骨
骭
骯
骰
骶
骷
骸
骺
骻
骼
骾
髀
髁
髂
髃
髅
髋
髌
髎
髏
髑
髒
髓
體
髕
髖
高
髙
髟
髠
髡
髦
髪
髫
髭
髮
髯
髳
髴
髹
髻
髼
鬀
鬁
鬂
鬃
鬅
鬆
鬈
鬋
鬌
鬍
鬏
鬓
鬘
鬙
鬚
鬛
鬟
鬠
鬢
鬣
鬥
鬦
鬧
鬨
鬩
鬪
鬬
鬭
鬮
鬯
鬱
鬲
鬳
鬴
鬻
鬼
鬽
魁
魂
魃
魄
魅
魇
魈
魊
魌
魍
魎
魏
魑
魔
魘
魚
魛
魝
魟
魤
魥
魨
魫
魬
魮
魯
魴
魷
魼
鮀
鮁
鮃
鮅
鮈
鮉
鮊
鮋
鮍
鮎
鮏
鮐
鮑
鮒
鮓
鮕
鮗
鮚
鮝
鮟
鮠
鮡
鮣
鮥
鮦
鮧
鮪
鮫
鮭
鮮
鮰
鮸
鮹
鮺
鮻
鮽
鮿
鯀
鯁
鯂
鯆
鯇
鯈
鯉
鯊
鯋
鯑
鯔
鯕
鯖
鯗
鯙
鯛
鯜
鯟
鯡
鯢
鯤
鯥
鯧
鯨
鯪
鯫
鯮
鯯
鯰
鯱
鯶
鯷
鯸
鯺
鯻
鯽
鯿
鰁
鰂
鰆
鰈
鰉
鰌
鰍
鰏
鰐
鰒
鰓
鰔
鰕
鰙
鰛
鰜
鰟
鰣
鰥
鰧
鰨
鰩
鰫
鰭
鰱
鰲
鰳
鰵
鰶
鰷
鰹
鰺
鰻
鰽
鰾
鰿
鱆
鱇
鱈
鱉
鱎
鱏
鱑
鱒
鱓
鱔
鱖
鱗
鱘
鱙
鱟
鱠
鱣
鱤
鱧
鱨
鱩
鱬
鱭
鱮
鱲
鱳
鱷
鱺
鱻
鱼
鱿
鲀
鲁
鲂
鲅
鲆
鲇
鲈
鲊
鲋
鲍
鲎
鲐
鲑
鲔
鲙
鲚
鲛
鲜
鲞
鲟
鲠
鲡
鲢
鲣
鲤
鲥
鲦
鲨
鲩
鲭
鲮
鲯
鲰
鲱
鲲
鲳
鲵
鲷
鲸
鲻
鲽
鳀
鳁
鳃
鳄
鳆
鳇
鳈
鳍
鳎
鳏
鳐
鳑
鳒
鳓
鳔
鳕
鳖
鳗
鳜
鳝
鳞
鳟
鳢
鳥
鳧
鳨
鳩
鳫
鳬
鳮
鳯
鳱
鳳
鳴
鳶
鳷
鳺
鳾
鴀
鴂
鴃
鴆
鴇
鴈
鴉
鴊
鴎
鴒
鴕
鴛
鴝
鴞
鴟
鴠
鴣
鴤
鴦
鴨
鴯
鴰
鴳
鴴
鴶
鴷
鴸
鴺
鴻
鴼
鴽
鴿
鵀
鵁
鵂
鵃
鵉
鵏
鵑
鵒
鵓
鵙
鵚
鵜
鵝
鵞
鵠
鵡
鵪
鵬
鵭
鵰
鵲
鵴
鵵
鵶
鵷
鵸
鵺
鵾
鶄
鶇
鶉
鶊
鶏
鶓
鶖
鶘
鶙
鶚
鶠
鶡
鶣
鶥
鶧
鶩
鶬
鶮
鶯
鶲
鶴
鶶
鶷
鶹
鶺
鶻
鶼
鶽
鶿
鷀
鷁
鷂
鷃
鷄
鷅
鷇
鷊
鷋
鷌
鷓
鷔
鷖
鷗
鷙
鷚
鷟
鷣
鷦
鷭
鷮
鷯
鷰
鷲
鷴
鷸
鷹
鷺
鷾
鸆
鸌
鸏
鸕
鸘
鸚
鸛
鸜
鸝
鸞
鸟
鸠
鸡
鸢
鸣
鸥
鸦
鸧
鸩
鸪
鸫
鸬
鸭
鸯
鸰
鸱
鸲
鸳
鸵
鸷
鸸
鸹
鸺
鸻
鸼
鸽
鸾
鸿
鹁
鹂
鹃
鹄
鹅
鹆
鹇
鹈
鹉
鹊
鹋
鹌
鹍
鹏
鹑
鹕
鹖
鹗
鹘
鹚
鹜
鹞
鹠
鹡
鹣
鹤
鹥
鹦
鹧
鹨
鹩
鹪
鹫
鹬
鹭
鹮
鹰
鹳
鹴
鹵
鹹
鹺
鹼
鹽
鹾
鹿
麀
麁
麂
麃
麄
麅
麇
麈
麊
麋
麐
麑
麒
麓
麕
麗
麜
麝
麞
麟
麤
麥
麦
麩
麪
麯
麴
麵
麸
麹
麺
麻
麽
麾
黃
黄
黅
黋
黍
黎
黏
黑
黒
黓
黔
黕
默
黙
黛
黜
黝
點
黠
黥
黧
黨
黩
黯
黰
黴
黶
黷
黹
黻
黼
黽
黾
黿
鼇
鼈
鼉
鼋
鼎
鼐
鼓
鼔
鼙
鼠
鼡
鼢
鼥
鼦
鼧
鼩
鼫
鼬
鼮
鼯
鼱
鼴
鼷
鼹
鼻
鼾
齁
齄
齅
齆
齉
齊
齋
齎
齏
齐
齑
齒
齔
齕
齜
齟
齠
齡
齢
齣
齦
齧
齩
齪
齬
齶
齷
齿
龀
龁
龂
龃
龄
龅
龆
龇
龈
龉
龊
龋
龌
龍
龎
龐
龑
龔
龕
龖
龘
龙
龛
龜
龝
龟
龠
龢
龥
龨
龮
龱
龴
龵
龶
龷
龸
龹
龿
鿃
Ꞗ
ꞗ
﨏
﨡
﨤
𠀧
𠀲
𠁀
𠁂
𠁑
𠁔
𠁟
𠃅
𠃔
𠃣
𠃩
𠄩
𠄻
𠄼
𠄽
𠅍
𠆳
𠇍
𠇮
𠊚
𠊛
𠊟
𠋦
𠍓
𠍵
𠎝
𠎣
𠎪
𠏳
𠐞
𠑽
𠒬
𠓀
𠓇
𠓑
𠓨
𠖈
𠖤
𠖯
𠖰
𠚢
𠞹
𠠩
𠤆
𠤷
𠦄
𠦳
𠧨
𠨪
𠫅
𠫾
𠬠
𠬧
𠮾
𠮿
𠯆
𠯇
𠯦
𠯪
𠯿
𠰁
𠰃
𠰌
𠰘
𠰙
𠰚
𠰩
𠰮
𠰳
𠰺
𠱆
𠱊
𠱋
𠱾
𠲖
𠲝
𠲟
𠲶
𠳐
𠳒
𠳖
𠳗
𠳚
𠳝
𠳨
𠳺
𠳿
𠴍
𠴑
𠴔
𠴗
𠴛
𠴠
𠴡
𠵱
𠶀
𠶆
𠶔
𠶗
𠶣
𠸌
𠸍
𠸕
𠸖
𠸗
𠸜
𠸟
𠸦
𠸬
𠹚
𠹛
𠹳
𠹴
𠹽
𠹾
𠺌
𠺙
𠺱
𠻀
𠻁
𠻆
𠻗
𠻨
𠻴
𠻵
𠼦
𠼯
𠼵
𠼾
𠽄
𠽆
𠽇
𠽋
𠽍
𠽐
𠽔
𠽖
𠽙
𠽮
𠾔
𠾕
𠾿
𠿃
𠿚
𠿯
𡀢
𡀯
𡁞
𡁹
𡁾
𡂂
𡃍
𡃑
𡃚
𡃹
𡄎
𡅧
𡅳
𡆫
𡉦
𡊨
𡊰
𡊱
𡊲
𡋿
𡌢
𡌽
𡌿
𡍼
𡎛
𡎝
𡎟
𡎢
𡎥
𡎦
𡏘
𡏢
𡏦
𡏧
𡐚
𡐡
𡑝
𡑱
𡒔
𡓃
𡓄
𡓮
𡕷
𡗉
𡗊
𡗋
𡗶
𡘯
𡙁
𡛔
𡛤
𡝖
𡞕
𡟱
𡠣
𡢐
𡢻
𡢼
𡢽
𡥙
𡥚
𡥵
𡦂
𡧲
𡧸
𡨌
𡨧
𡨸
𡨹
𡨺
𡬷
𡬼
𡭧
𡮇
𡮈
𡮍
𡮨
𡮮
𡮳
𡮶
𡱩
𡱮
𡱸
𡲈
𡲤
𡳃
𡳒
𡳪
𡳳
𡳵
𡴯
𡵆
𡶀
𡶨
𡸈
𡹡
𡺄
𡺅
𡻕
𡽫
𡾵
𢀨
𢀭
𢀲
𢁍
𢂎
𢃄
𢄂
𢄼
𢆥
𢇡
𢈱
𢌃
𢌌
𢏑
𢒎
𢖖
𢖵
𢗃
𢗼
𢘝
𢘩
𢘾
𢙇
𢙲
𢚁
𢚵
𢚷
𢚸
𢜝
𢜠
𢝙
𢝜
𢞂
𢠅
𢠨
𢠩
𢠿
𢡚
𢢆
𢢲
𢣃
𢣧
𢤞
𢥮
𢦤
𢧚
𢩮
𢩽
𢩾
𢪀
𢪉
𢪒
𢪠
𢫊
𢫔
𢫘
𢫝
𢫫
𢬂
𢬄
𢬗
𢬣
𢬥
𢬦
𢬧
𢬭
𢭂
𢭄
𢭗
𢭩
𢭮
𢭯
𢭲
𢭴
𢭸
𢭾
𢮪
𢮿
𢯏
𢯜
𢯟
𢯦
𢯰
𢱖
𢱗
𢲛
𢳀
𢴑
𢴾
𢴿
𢵼
𢶒
𢶢
𢶻
𢷀
𢷏
𢷣
𢷮
𢸚
𢹂
𢹣
𢺤
𢺹
𢺺
𢼂
𢽙
𢽼
𣁰
𣂷
𣃣
𣃱
𣃲
𣅘
𣅶
𣆭
𣆴
𣇄
𣇊
𣇜
𣇞
𣈗
𣈘
𣈙
𣈜
𣉙
𣋀
𣋁
𣋂
𣋚
𣋽
𣌁
𣌉
𣌋
𣌝
𣎀
𣎃
𣐙
𣐳
𣑁
𣑦
𣑯
𣑻
𣒣
𣒲
𣒵
𣓿
𣔥
𣕲
𣖖
𣖢
𣖮
𣗳
𣘃
𣘈
𣘛
𣘽
𣙩
𣛟
𣛠
𣛧
𣜿
𣟪
𣣱
𣦆
𣦍
𣦎
𣨟
𣨰
𣩂
𣫂
𣱽
𣲆
𣲍
𣳔
𣳮
𣴓
𣵰
𣵶
𣷭
𣷮
𣷷
𣸲
𣹓
𣹕
𣹟
𣺽
𣻃
𣻄
𣻆
𣻕
𣻟
𣼕
𣼭
𣼯
𣼸
𣼽
𣽊
𣾴
𣾶
𣾺
𣾼
𣿌
𤀏
𤀓
𤁕
𤂬
𤄯
𤇊
𤇧
𤈊
𤈘
𤈛
𤈜
𤈪
𤉒
𤉗
𤉜
𤊰
𤋵
𤋾
𤌄
𤌋
𤍇
𤍌
𤍎
𤍶
𤎎
𤎒
𤎜
𤏣
𤏧
𤐜
𤐝
𤑍
𤑟
𤒘
𤓢
𤕵
𤗖
𤗹
𤜯
𤝞
𤞑
𤞻
𤟕
𤟛
𤟪
𤠄
𤡛
𤢇
𤢿
𤤰
𤤻
𤦛
𤩽
𤭸
𤯝
𤯨
𤯩
𤯭
𤱈
𤳄
𤳆
𤳇
𤴡
𤴪
𤴬
𤵖
𤵺
𤶐
𤶑
𤷄
𤷍
𤷙
𤷱
𤸫
𤻻
𤼵
𤼸
𤽗
𤽸
𤾓
𤿰
𥁚
𥃱
𥄭
𥄮
𥅦
𥆁
𥆾
𥉩
𥉬
𥉰
𥊘
𥊛
𥊢
𥊣
𥊩
𥊳
𥋳
𥋴
𥋷
𥏌
𥐆
𥐨
𥑥
𥒅
𥒥
𥒦
𥔎
𥔿
𥕄
𥗐
𥘀
𥘉
𥘷
𥘾
𥙧
𥙩
𥚆
𥚇
𥚚
𥛉
𥝝
𥝥
𥞁
𥟍
𥢆
𥪝
𥪞
𥪸
𥬉
𥬊
𥮉
𥮊
𥮋
𥯌
𥯎
𥯒
𥯓
𥯤
𥯨
𥰊
𥱬
𥱰
𥳑
𥴙
𥴜
𥶄
𥸤
𥸷
𥹰
𥺹
𥾒
𥾽
𥾾
𥿁
𥿄
𥿗
𥿠
𥿥
𥿺
𦀊
𦀎
𦀚
𦀫
𦀻
𦀼
𦀾
𦂛
𦂳
𦂶
𦂾
𦄂
𦄾
𦅰
𦆆
𦇒
𦊚
𦊛
𦋦
𦍌
𦍛
𦎍
𦎛
𦏁
𦑃
𦑗
𦒹
𦓡
𦓿
𦕈
𦖑
𦖻
𦘧
𦙟
𦙤
𦚐
𦚖
𦛌
𦛜
𦝄
𦟐
𦟱
𦠄
𦠘
𦡙
𦢳
𦣰
𦤶
𦤾
𦥷
𦧘
𦨢
𦫒
𦬑
𦭒
𦮎
𦯬
𦰟
𦰤
𦲿
𦹥
𦹳
𦹵
𦹷
𦺓
𦼔
𦾔
𧀒
𧁷
𧂭
𧃰
𧇊
𧈧
𧊉
𧋃
𧋆
𧋻
𧍉
𧍋
𧍝
𧍰
𧏵
𧐖
𧑞
𧓍
𧔧
𧕚
𧖱
𧗅
𧗱
𧗼
𧘇
𧛋
𧜖
𧝓
𧡊
𧡟
𧣳
𧥇
𧥾
𧦈
𧩙
𧯄
𧯶
𧳋
𧴤
𧵆
𧵑
𧶘
𧷺
𧺀
𧺁
𧻐
𧻗
𧻭
𧼈
𧼋
𧿆
𧿨
𧿫
𨀈
𨀊
𨀌
𨀒
𨀺
𨁏
𨁡
𨁪
𨁮
𨁯
𨁹
𨂘
𨂚
𨂻
𨃉
𨃐
𨃝
𨃴
𨄹
𨅌
𨅸
𨅹
𨆝
𨆢
𨇍
𨇒
𨇜
𨉓
𨊠
𨋣
𨍦
𨐓
𨐸
𨑗
𨑤
𨑮
𨑰
𨒒
𨒖
𨒣
𨒺
𨒻
𨓡
𨔈
𨔉
𨔊
𨔍
𨔾
𨔿
𨕭
𨖅
𨖲
𨠳
𨢄
𨢇
𨤔
𨤠
𨤧
𨤮
𨤰
𨦟
𨦩
𨨲
𨪙
𨪪
𨭗
𨭥
𨯹
𨱽
𨳒
𨴦
𨷑
𨷶
𨸈
𨺻
𨻫
𨻶
𨿽
𩁶
𩂏
𩂟
𩂶
𩄓
𩄰
𩄲
𩅀
𩅗
𩅘
𩆋
𩆐
𩆪
𩆷
𩈘
𩌂
𩑛
𩓙
𩔗
𩖀
𩘪
𩙋
𩙌
𩚏
𩚵
𩛂
𩛜
𩛷
𩡭
𩢬
𩦓
𩯀
𩱛
𩲉
𩲡
𩴬
𩹌
𩾛
𩿨
𪀄
𪀊
𪂮
𪂲
𪅴
𪇴
𪔠
𪖫
𪘵
𪚔
𪟂
𪟦
𪟽
𪠘
𪡔
𪡵
𪢈
𪢖
𪣷
𪤄
𪤍
𪧚
𪨀
𪨃
𪩘
𪪳
𪫢
𪫧
𪬡
𪭟
𪭯
𪮙
𪮚
𪮞
𪮭
𪮻
𪰛
𪰹
𪱆
𪱨
𪳔
𪵟
𪷞
𪹚
𪹣
𪹾
𪽐
𪽗
𪽝
𪽡
𪾦
𪿒
𪿙
𫀅
𫀢
𫁅
𫂗
𫃚
𫃫
𫃸
𫄄
𫅜
𫅠
𫅩
𫅷
𫆧
𫇰
𫈣
𫉚
𫋻
𫌇
𫌵
𫎇
𫏾
𫐮
𫐷
𫒥
𫔤
𫔭
𫔮
𫔳
𫔸
𫕲
𫗁
𫗂
𫗃
𫗄
𫚳
𫠓
𫡂
𫡉
𫡮
𫡻
𫢋
𫢩
𫥌
𫥧
𫥨
𫦻
𫧇
𫨩
𫪹
𫫗
𫫵
𫫽
𫬍
𫭧
𫮇
𫯳
𫰅
𫱞
𫳘
𫳭
𫳵
𫴋
𫵀
𫵟
𫷜
𫺶
𫼢
𫼰
𫼳
𫽄
𫽘
𫽻
𫾐
𬁖
𬁻
𬂙
𬃑
𬅉
𬆄
𬆅
𬇚
𬊤
𬋌
𬋟
𬋩
𬌓
𬌥
𬎼
𬏓
𬏝
𬏩
𬐒
𬑉
𬑰
𬓲
𬕹
𬖉
𬗏
𬗔
𬗢
𬙞
𬙾
𬚱
𬚶
𬛒
𬛩
𬞕
𬞰
𬞺
𬟗
𬟥
𬡢
𬡹
𬢱
𬦃
𬦮
𬦼
𬧖
𬧺
𬨠
𬫤
𬮌
𬮎
𬮙
𬮜
𬮦
𬯵
𬰅
𬰓
𬲄
𬲇
𬲊
𬷤
𬹸
𬺍
𬺗
𬺚
𬼀
𬾠
𭁈
𭃂
𭄁
𭉑
𭉩
𭍝
𭎑
𭓇
𭓡
𭔎
𭔰
𭛁
𭛣
𭛤
𭝫
𭡏
𭧙
𭫨
𭰃
𭴣
𭶚
𭸓
𮌐
𮎦
𮗓
𮞏
𮢶
𮥠
𮥷
𮦡
󰓳
暴
郎
翻
檜
衲
ゲ
取
菩
訛
噓
甍
亭
凢
庇
毛
読
賈
鼎
燕
剰
蚫
徂
凝
陣
豕
誦
丞
窮
寶
鱧
啼
米
征
肴
餡
糸
醐
哭
遁
所
㝡
桝
䏻
牒
詛
蘭
ウ
百
據
錄
斧
吾
塀
友
触
萩
凋
惹
探
財
恍
ぽ
酴
ケ
感
訪
拭
惡
べ
義
琴
滸
跨
蜥
弐
急
凉
乞
淵
誡
等
穀
畠
癡
災
盃
潟
玖
尿
衡
戸
醒
殼
縛
鮅
本
誕
騎
宗
渾
課
亀
吭
呪
兜
小
芒
於
僵
拒
名
喜
蕃
樋
冰
甜
婦
乙
貿
預
箏
變
宴
攫
釋
系
咬
睦
于
許
億
徹
穴
鯎
毘
虧
膈
力
喘
逆
柾
草
雙
資
顱
帯
閧
禪
裁
来
壇
鐃
炭
徃
二
舅
科
霰
櫨
西
岡
溪
笙
魏
與
ぼ
屑
茲
屐
飢
縷
舜
辟
坑
並
酎
畦
嘈
肢
純
簡
蜘
飼
ブ
眷
這
未
藁
禽
爐
痿
藐
熾
懐
鯔
冝
瞼
噫
夕
厂
雉
喧
武
焦
午
ら
曹
形
ま
著
獨
総
渕
嬬
乱
柊
學
慚
佳
誓
慧
万
胸
傭
操
豆
利
透
衛
癩
顛
寫
冠
続
誨
滿
徐
欝
額
歟
嫩
劣
楂
懸
椀
剥
因
な
閤
榮
妬
風
蔓
豪
蝓
鶍
沢
幡
稗
㚑
隂
袋
土
筭
ヘ
霧
艸
鰶
贈
蔵
卜
恭
按
粕
時
促
餐
穿
窈
筵
豉
莾
次
邨
札
麩
鈎
言
條
𤍽
ぞ
姻
倩
威
了
娯
厭
頻
擬
藻
廿
孩
鱮
檻
便
崔
扮
糟
槎
拍
薨
呈
鱇
齒
麪
枋
貴
俺
榕
寛
概
援
靜
麦
韓
岸
喫
驪
役
互
台
項
視
椅
昌
湿
娑
經
冊
ず
濯
斤
剪
朕
蟋
謠
竝
姑
愈
粽
缺
蝴
整
沿
漁
雇
糝
弗
槌
歡
噴
㐂
幻
們
様
鰾
宜
従
礬
敎
フ
栃
誹
栢
纔
妹
擊
粹
婆
識
蟒
か
配
桓
バ
治
愿
町
秀
〇
笞
枴
臨
嫗
椿
王
勘
抗
鱈
寡
飛
璧
杠
ノ
怒
ョ
忠
虵
抓
備
乳
構
蟄
忙
薔
倘
随
文
館
鳧
そ
器
盞
挾
顯
坂
割
薄
蜩
餃
啻
呵
隊
羅
戒
嶺
迷
蒲
静
懶
寤
浩
潤
鷺
変
偶
伏
鯊
鬱
〆
密
憤
四
引
瑙
尋
誇
魑
襖
唾
紛
餘
運
請
竟
欽
煖
螫
刷
頥
釈
晞
醿
江
冶
棄
發
症
廊
塵
飜
山
碁
即
究
汾
茅
疊
饉
舁
功
醉
脈
冉
謫
盡
緒
陵
難
鈴
某
牡
旗
油
棧
題
遶
晋
調
閻
述
弑
釣
癒
允
錫
れ
咎
巧
団
撹
寅
咽
片
絶
蕉
刕
弔
騷
能
罟
豚
楯
否
紙
租
瓜
一
氏
済
苺
婿
鍋
沙
長
双
溢
澁
餲
園
瀉
奉
繼
中
儡
曇
危
碑
鄙
胃
蟠
腎
鄕
奕
洞
禅
沸
靖
酸
叶
謀
掴
㊂
焉
戈
翰
譚
搜
鶯
埔
レ
囁
鉦
黒
藪
篠
埜
試
衢
㊀
堕
疳
萠
粟
継
鞁
圡
術
誠
博
隔
方
訂
坡
死
渭
貰
相
晦
傅
埃
菘
踈
暇
嗜
碧
建
環
格
晃
奮
隅
範
囿
娵
妖
筧
廉
返
哲
「
祈
翫
噂
巴
諷
選
邪
俄
笛
悦
袍
都
扶
映
厚
品
勞
蚺
軍
茂
規
拝
恙
ム
朗
鮎
礫
鍼
井
囉
註
卯
む
設
偖
天
踞
北
殯
皈
腿
途
嶋
癇
震
殷
獄
煑
包
賛
ニ
狼
処
裳
添
咄
丑
笊
㕝
渤
肖
輒
差
汀
襄
注
濁
驗
蔬
斉
旌
円
勤
将
桜
戮
鹵
觜
耳
曉
僥
杓
攝
遇
襲
妨
弱
才
簍
傑
授
恋
桑
罰
助
更
芦
淀
廃
宦
蘇
凹
呑
較
艷
菪
臣
籍
壺
担
撞
鞠
惟
姉
奔
採
燭
釘
俸
仕
祀
ダ
送
叔
推
蝸
短
緋
嗽
象
温
諌
㔫
淋
ゐ
耆
県
欠
鰛
紵
漢
耶
眠
仰
盗
ゞ
杣
衰
鼾
氣
限
黎
若
乎
青
賞
昏
僞
・
与
畑
麸
鋒
固
腋
眩
諛
微
普
鼈
囬
葭
半
ス
明
藉
鍛
寇
剤
隻
餅
驛
受
苗
幇
決
せ
春
蕩
ソ
眸
哽
毫
遭
膝
枚
費
波
紋
械
迎
漂
士
擧
瓠
鮨
婚
顏
ク
廩
辻
け
淫
狩
駑
看
愛
釵
勦
嶽
盤
云
ネ
比
奠
善
藩
渠
伝
交
槿
ザ
筆
ァ
嵐
鮧
瓢
冥
杏
梳
飾
嘸
螺
画
奈
梯
囘
諢
詣
兌
榧
伉
燠
臙
端
疵
壊
押
陽
蚤
濫
髫
狽
慄
池
宥
興
扉
煽
柘
蜈
栖
楚
嚢
岑
眉
詞
喻
蜴
聘
匣
打
昆
媛
擒
屁
緇
瑪
高
齡
薮
黠
褥
蝮
縑
諚
蓴
貼
零
党
炳
蜑
虞
磁
介
戴
出
光
マ
獺
有
唄
篦
付
克
番
幣
盆
芸
講
戦
范
丼
旁
靭
閉
灰
鰥
挿
乘
湯
参
鉢
頼
声
俤
伽
會
約
悩
灯
鵞
倫
怖
碎
雛
煙
既
俘
迄
漬
錐
渟
穏
炊
木
萸
駄
蘿
防
采
鱏
詠
息
桟
川
莟
冩
簒
応
牢
慾
跡
苅
髄
常
憎
蠎
切
非
裕
埋
苓
邦
掩
却
稼
赫
臼
頂
蒔
鷲
啖
吮
東
侍
榊
魅
璽
到
薗
鎰
持
恰
譬
陀
煬
牧
舩
鹽
お
宣
俎
ね
匠
濵
顕
又
湧
率
蹤
肯
薫
斬
裸
。
驕
個
媒
夥
多
槙
矢
燃
鉤
跳
根
客
繕
效
鞍
磤
逸
贅
蜒
錬
亘
跪
掠
愍
賎
鮓
ん
齊
荷
睡
惻
裙
畳
蚰
縁
モ
悔
伯
潦
呂
畿
迩
氊
級
崖
徽
慙
澤
瘡
鷂
蹴
喩
尽
鎔
ろ
梢
折
荊
硯
以
悟
蜃
梧
鍮
忰
鋪
架
茱
埵
ぱ
蒟
逓
営
昨
圭
辨
害
聊
鼻
唱
賀
盒
彩
誌
鮟
芳
拠
退
槪
評
談
榎
箕
車
續
低
荼
停
界
蚯
避
敦
强
洪
卸
載
耽
蕺
◯
孰
蒜
莖
笋
険
権
刄
蹊
啓
良
沼
点
」
快
祖
卵
團
屍
雫
搦
ユ
慕
猴
甘
違
蛙
只
蚓
尼
閼
朴
賺
髓
辭
奸
恩
蘂
噬
諸
ガ
浸
廓
周
妾
曾
鋭
吝
痞
貟
稍
來
怕
殿
曙
歌
跟
臑
鬧
惠
嘲
え
謙
彫
怯
鶆
擂
傲
綾
蒡
蕨
倣
叱
鰩
假
塲
憐
作
蛍
蝿
㒵
央
彎
鰐
扱
揚
擔
刺
棘
兎
皿
暖
竊
粮
隨
蚊
牛
菝
蒻
舌
龍
数
膏
轤
蝉
猫
棟
儀
驢
休
禦
村
暁
招
鵜
烟
稠
蕎
左
ゑ
餌
砕
蛛
甫
筌
塔
給
季
刀
斑
睾
帷
あ
射
而
廟
迫
沫
丙
寧
劇
尓
嗇
俗
司
兇
髙
ち
益
暦
莚
豌
怨
鏊
聢
儒
戟
戎
考
亦
柔
各
潜
圍
狂
薙
巾
佀
蹉
蠶
英
蛎
蟷
抽
寞
ジ
順
恵
鳫
忌
坊
蝕
皷
孝
耕
故
冑
濤
挺
締
積
雖
失
謹
笹
藥
卑
矩
侭
鴬
戊
ご
開
銘
柯
晶
邂
紹
竅
鳶
永
雷
鋤
苣
頡
偸
躊
蹈
前
歴
ア
詈
図
髪
葜
舒
守
寸
稱
躍
虻
択
螻
影
淪
履
岨
謡
協
當
類
窶
鬒
豐
獵
理
托
旃
嚮
罹
忘
僉
堵
悉
勲
事
葡
火
溫
羽
郊
描
雋
て
空
醴
院
蛇
砧
烏
仆
元
腸
装
動
忝
卿
逼
宋
柳
敝
靱
逞
嚴
款
錠
南
築
独
鄭
狸
部
店
滅
碓
卄
カ
狗
棉
早
櫓
情
讀
薹
煎
居
賤
跋
為
僅
蔭
奏
〱
階
那
硫
湛
綺
蟇
楓
最
縺
梗
後
舵
卷
碗
齋
六
蛞
埀
闕
届
惮
汰
䑓
張
寿
策
烹
贈
同
澄
什
幸
玄
セ
昴
砌
嶌
〻
舎
可
渦
孜
凶
嫁
乃
千
近
疫
立
饒
粃
碌
爵
𠵅
労
鎮
燗
匁
壑
朽
躰
諦
酷
葬
熨
ハ
株
桧
轟
瘤
略
厨
蘋
虹
ロ
滋
燼
困
𤋎
振
衿
覇
稻
菱
箇
蔔
塗
貧
啄
造
腹
胷
冷
憖
罌
劉
辰
繻
絆
摺
廻
得
懼
醍
側
督
占
じ
束
堪
芡
黨
禰
茜
莧
案
雞
徘
坦
増
披
貮
誼
販
玲
肱
鉾
渺
巵
襟
り
眞
嫰
致
攻
嬲
棲
闇
菫
决
几
繋
需
瑞
問
墮
羞
倦
彷
た
胡
残
太
ベ
字
面
柹
娘
貨
亍
渇
肘
粔
尚
蒿
競
憇
駅
吉
掟
槍
梨
輩
三
綢
粧
撒
臟
繭
怙
默
迯
曽
内
裒
聟
工
性
騫
身
樓
薏
皆
紡
辜
鳴
鬣
疱
錢
飲
卒
庖
挙
萱
脾
簀
栲
隼
模
巨
珪
蕷
頰
民
滝
敷
權
収
全
况
真
箸
岳
燵
街
毆
懈
弦
繾
舶
翌
売
霽
楡
莽
パ
瑚
鴈
慢
霄
麺
蟀
姨
杭
蠅
志
涎
斗
弟
峰
昭
沃
遂
杷
邊
墾
酌
嚀
哀
呆
鎖
ゴ
莨
髭
法
琉
畧
游
鷯
日
炙
蝠
蚕
杵
巡
攘
塩
漆
借
向
扇
苡
罸
踝
語
省
婢
鷗
琳
右
蹄
盾
刻
鑓
屓
鱠
糠
僧
程
朶
檢
宇
湊
細
閃
繩
諏
祥
鯒
踊
醢
賭
畷
加
竺
祗
拗
麴
臓
兒
舛
1
箭
月
艶
褌
称
礼
菽
胤
壮
醸
々
衣
始
命
屬
孫
努
ッ
疋
蜍
荅
蜊
蕣
均
汁
換
船
舞
厳
胎
必
菖
收
脣
筑
菁
覆
批
ヌ
丘
漕
檀
坤
腥
此
鬪
盧
予
貞
駭
焚
京
戌
裡
料
藏
穪
泻
讒
淡
条
崙
陥
麝
舗
異
肩
柄
夙
蛯
膂
幢
菊
幷
覽
霞
越
病
リ
囃
プ
恕
鯵
蟛
漣
腫
倭
苞
挊
花
浦
棚
匆
蘘
夏
粤
瑕
掃
彈
籬
展
局
凍
水
嘩
鬮
梁
親
辛
贋
稜
訓
磨
犇
沈
説
騨
窺
繆
呉
要
朮
苦
褁
聲
莞
落
峙
毎
枩
㤙
鯷
獲
侫
暮
窃
鰔
爲
宏
颯
觀
孤
腦
噎
樂
拉
蜷
姓
渋
芥
化
眼
蔡
頑
蕭
聞
閣
傷
刈
丗
煩
供
黿
諾
髮
厠
猟
禹
露
桃
襴
鎌
祓
式
脩
塞
好
撤
章
貸
肝
皇
饗
國
矛
篇
覧
齢
誘
痰
伸
実
頗
卓
鈍
噪
脆
悍
焙
エ
梭
嶮
僧
柿
刃
如
陶
譲
襁
旭
尾
褓
鏑
拊
蚶
筥
累
鎗
姚
彦
副
鵲
鷄
戚
莱
串
毬
惑
癈
戯
刊
革
祭
綿
市
恨
腐
棠
削
執
鶏
德
扁
巫
離
窓
羊
熬
刪
贔
ゅ
世
宝
灘
妊
奇
湾
柱
嬉
剣
反
沐
鸞
融
勢
洋
雜
營
點
濕
路
浅
鮪
嘘
標
狎
僂
柚
鬘
鏤
幅
詩
緑
軽
椹
鞘
廱
葢
雲
拔
係
ゟ
播
銕
強
聳
谷
潰
搗
紂
綸
攪
㐫
礒
梶
伺
佞
栄
箪
き
苔
糯
忿
芝
底
些
唖
糜
弥
咸
植
際
㊁
拶
萊
盖
餓
雀
耒
夜
淨
捐
屆
鞆
逐
軈
憾
堀
橋
寳
誂
業
忽
族
列
暹
汶
創
荘
宮
抑
佛
汲
董
織
篭
老
干
女
惱
䲙
箔
層
憲
久
尊
－
簪
叟
無
含
肚
繍
派
ヤ
訴
気
粒
監
捌
捲
梔
綻
首
脉
瓏
神
裏
巌
吃
關
依
板
摩
裘
慰
絮
人
鎧
隷
偈
鱊
愉
突
册
況
遑
房
鳥
雎
妃
膾
蜿
ピ
絃
皂
淺
暫
抔
八
葉
遊
懺
准
傘
悠
金
痘
量
掌
己
殺
穢
秧
鈷
蜆
屠
鼓
ヶ
蓮
ヂ
譜
軒
練
充
逢
輙
行
没
い
筈
溏
菔
門
蛤
伴
チ
紐
勧
騰
酬
簿
樹
余
喰
漿
撮
鴒
件
師
弾
嫡
紅
婪
帆
他
艘
艾
截
州
侯
挫
染
遣
靨
瞿
禮
誅
諱
檍
悋
吟
銅
意
新
ポ
糊
優
活
座
邑
縦
袢
柬
仲
特
耐
角
鮫
叢
貫
妄
自
麿
練
惇
畄
貯
宿
塊
康
ふ
賦
亡
縣
愚
晴
嚼
契
之
鱅
赤
敬
秩
簑
靼
仭
泰
別
歯
槳
補
望
輿
凄
耗
ヲ
畏
駕
盜
ワ
丸
ボ
除
兼
抦
訥
苛
潛
駝
机
嘗
晨
五
頓
竄
鰒
証
頃
貪
狄
仍
顔
鍔
年
挨
榴
稲
罔
簗
對
猿
囊
嬢
海
畸
籏
鰯
獣
佐
虱
さ
徒
走
桔
俳
績
入
舟
茨
鰤
癖
艱
娟
候
秦
慨
仇
柴
兩
投
藝
孔
糀
欧
諺
哮
且
療
椙
樽
鶉
斃
刹
鶴
孕
者
足
幾
廰
つ
般
藍
蒙
浄
胞
郭
痢
殽
沽
黯
撥
扈
洲
縞
笧
僕
広
婬
照
黄
消
椽
笄
阜
第
像
懇
会
器
拙
朋
捕
泄
蜀
幟
顆
絨
殖
疂
□
愼
傀
炉
芭
亂
奥
敵
諍
逰
雹
寒
両
觸
庶
趙
韃
牆
益
債
咨
尉
廢
楊
猥
靂
胆
謐
抱
緬
田
悶
蕪
銜
ヱ
摠
壷
侘
拷
精
迦
籾
縻
歳
貝
朦
茹
梟
熟
箒
軰
鱁
垂
裟
珎
我
歸
隙
徊
演
捧
竭
粲
戰
軀
扛
寺
峨
麋
こ
ナ
濟
糫
宰
篤
紺
苧
タ
当
涌
緩
薑
捷
啜
芽
蜻
辺
ラ
礙
種
竒
聽
禄
鰹
鏡
寂
ギ
不
尺
求
勉
篆
詫
攀
勝
叫
椒
捜
歓
口
ゆ
教
區
緊
庻
賓
賔
蒼
寝
遥
傾
睨
筍
彙
膠
弧
重
蟻
槃
酢
段
舘
蠃
彌
纒
駆
栗
摸
餉
遠
泉
耀
哢
惣
獸
揆
峠
告
斜
槗
爰
催
瀬
耻
転
慳
摧
岩
鱚
霜
ヅ
摘
養
育
洒
蝙
茫
置
柑
句
込
橘
疾
認
聴
衝
郁
ー
蝋
袂
河
蕾
黐
逃
劔
討
径
袷
肉
則
揮
柩
及
手
玩
恐
甥
菌
擴
椎
闖
経
謂
賣
修
斟
味
製
検
剛
接
磽
号
斐
髻
肆
鯲
駿
励
信
榛
乍
喃
賢
寔
港
ゃ
歛
磯
舂
饋
薬
欺
愕
軸
智
デ
兀
單
栁
鬢
汗
體
蹟
闍
葵
爨
痣
茘
玉
鑑
の
障
劫
祷
熊
偽
蔀
森
鹿
ィ
曜
剱
姪
糒
喝
成
今
裂
菓
做
杉
瀧
と
衆
託
賊
堆
浪
亨
屏
鐐
帽
倍
待
郷
尭
翠
庄
粂
剃
壻
敢
嗅
う
グ
叛
篗
艮
閨
鯱
仁
徠
繁
習
奴
竃
へ
斯
鄰
咀
揷
薦
槫
臥
翁
詐
脂
色
從
鱺
蛟
疝
罵
商
昼
陸
戶
位
球
何
絵
茄
糞
谿
鮹
腕
鮮
剩
ば
盥
安
上
ひ
靣
ぬ
節
亥
音
杜
專
藜
羮
仏
摹
諭
楝
囲
蟾
閔
澡
瘟
府
払
降
登
縮
黙
噐
免
松
務
庚
岐
度
鮒
帥
熱
桐
び
芙
野
㡣
瓦
壯
醯
慂
陷
蝶
服
酉
莅
茎
櫛
眺
誤
賑
捻
堺
抛
脚
珊
裝
朱
袈
薺
舍
遙
銀
㑹
是
至
確
膳
紫
壞
達
雌
齟
俱
瓶
儲
倖
秉
だ
表
郡
堰
麓
鷹
寃
鶫
渉
廣
訟
響
櫃
尻
薁
募
縵
倒
賄
盲
寨
夭
ル
雨
麟
倶
間
煥
紀
ホ
琵
臍
掾
ょ
雕
涕
棍
蕗
杖
窪
虎
洩
●
帛
踏
祇
股
姦
偕
摂
媽
瞳
莊
湖
裹
単
蕊
媚
組
ヾ
夫
歩
鏃
享
筏
飩
毀
脳
撲
農
聡
悲
欬
保
精
清
把
參
導
舐
痛
臆
通
コ
屛
祈
梵
捉
逍
写
號
止
墜
魘
曼
禿
薯
巳
ン
序
斂
愧
其
存
壌
狭
萼
虬
や
生
づ
謝
痩
繊
線
場
艪
符
脛
寓
粳
鉄
俟
赴
大
厄
遮
蠻
血
霖
喚
囓
思
揩
藷
姥
撃
責
揃
桀
掬
菜
七
樺
似
盟
甞
叡
支
耘
君
蛭
曲
畫
み
覚
芍
官
皺
勵
鮭
檎
惚
ミ
疹
唐
證
璃
壱
旧
統
吏
激
偏
僑
痴
灵
綴
蔦
麻
釿
暗
頭
対
溺
㓛
華
庫
距
犯
願
觧
桶
児
絲
恪
弘
櫻
爛
砺
廷
妻
圃
書
丈
壤
詰
氈
蛄
叩
燈
猶
泊
垣
源
指
聖
甕
荻
讓
沖
鼠
宕
憑
関
銭
鱸
崑
蒐
蔕
臂
諫
掘
娶
陋
仝
使
脇
併
ぴ
鵝
㫖
潅
剖
乗
泅
テ
藺
悌
尹
拳
劒
記
咳
仮
坐
揉
叉
磐
辞
壬
目
枯
御
祝
醫
刧
校
驍
葍
働
虚
萌
示
橡
贖
踪
観
怪
灸
覺
閲
謨
徑
鰊
纜
庭
刑
袴
俊
乾
貶
疎
糕
欣
稿
荒
ぢ
易
申
物
巣
キ
醤
險
海
職
傍
汚
彭
槁
話
犬
茼
睪
隠
果
験
將
佇
寮
枇
籃
厘
宸
擇
隱
制
冤
捫
帰
研
救
髯
苻
煉
負
嫌
維
㔟
報
集
膚
泪
昧
馬
ぎ
堤
躬
体
横
馴
孟
拘
銃
浴
骨
粥
袖
秘
楽
敗
楼
隆
雅
繰
葩
齬
ツ
粉
凌
醪
律
濱
城
鯖
翅
蜂
曰
効
頴
懲
趾
頽
聚
漠
鼬
籟
壽
櫂
技
宙
炮
兵
患
竹
戀
繞
九
賂
毒
摚
瘰
瓊
分
移
樟
拌
媵
涼
初
宛
蓋
鳳
竜
勃
属
慥
屡
曝
滴
忍
箙
徨
は
議
恃
星
烈
斷
十
葱
尖
煤
升
昔
護
旦
隋
買
癸
島
詮
虐
末
屈
匿
陌
寐
的
𤇆
蟲
殻
悖
泳
颪
洗
徳
ヨ
嬰
褒
讚
索
枸
駐
憂
泝
和
爪
娼
蓼
笏
祚
捨
籠
葺
据
尠
吸
枡
鷦
堂
蓉
頌
魄
韮
餹
犀
鰌
凡
畒
渚
吶
尅
繡
国
彼
俵
共
先
ビ
渓
嵜
莫
起
恠
桁
放
排
鞭
殆
結
墨
直
牀
施
悪
麒
靡
樒
處
鑛
廼
現
鼡
紊
携
掛
疑
轆
古
滑
喉
逗
吻
𥝐
狷
﨟
櫚
崇
電
具
囀
恒
極
母
唯
應
貌
盈
蘡
室
態
漉
矣
0
闌
炬
畚
窟
杦
測
躇
價
炎
溜
禁
童
メ
鮑
が
㊃
拜
期
炒
稚
个
𠀋
奚
癪
瞬
尢
讐
丁
麁
里
邈
杯
貢
稀
鋸
蒸
巷
埒
鯛
傚
臺
傳
胴
芹
无
棒
麹
或
囂
淹
鞋
槩
復
錆
満
姜
よ
枷
餝
材
瀑
福
富
産
見
桂
汐
黍
嵩
埓
蛾
縄
梅
衞
由
槇
嵯
總
追
箱
砂
恥
呼
諧
醜
狛
輪
獰
逝
糧
価
嗔
蛮
魯
隘
沒
臚
諜
鑄
鰻
靈
齣
着
鴻
父
甚
歇
鉋
念
勸
歎
ぺ
咫
終
萄
定
論
勅
魚
濃
に
哥
深
殘
帙
卧
適
争
豫
針
幼
渡
班
恣
虗
鴞
察
藤
羹
質
訳
濡
糺
苑
佗
シ
酩
痤
甲
陳
枝
布
茴
遍
げ
連
蝦
瘧
閙
侠
鱝
粘
箆
芟
査
嗣
席
彿
翳
男
封
蝎
泣
ぷ
菴
豈
錯
檗
遲
基
轡
醬
網
被
并
納
鱗
夢
獻
臘
曆
替
吹
潮
就
猪
速
勇
紬
甑
挌
邉
漏
煮
暑
遅
爽
躾
ド
縊
泡
抜
旨
詔
丹
賜
昂
蠜
爾
阿
䂓
留
っ
也
穂
闢
〽
撓
疣
鰕
く
外
驥
巢
ゝ
嶼
し
挑
林
勿
刎
鑿
閏
薊
敖
献
茸
涯
氷
㊄
承
竈
鋳
馭
曠
拐
闊
肥
詳
扑
簾
耄
萍
弁
崩
臈
壹
再
秋
菅
浮
纏
羈
隣
唇
觴
篩
誰
誑
黛
帋
流
剋
僻
噌
瞻
憚
素
香
洛
去
㘴
巖
犢
完
員
蓬
鬼
憎
用
琢
訣
嗟
俠
畔
乏
編
汝
辷
葛
迂
蹲
坪
猛
簔
劍
哉
粋
遽
虫
惜
薩
牙
め
宅
峯
漲
改
嘆
帖
儘
栽
滄
棊
鵑
釀
杢
鑰
牝
迺
謌
印
平
褐
譽
躯
痕
畜
广
核
鵐
史
贄
ぶ
杞
咲
ヽ
税
遵
蠕
縡
拵
散
窩
崎
釜
須
誉
﨑
擲
宍
瑣
蛸
断
躁
糖
慎
阪
兮
陪
鐵
萬
搖
柵
羣
朝
寢
合
ぐ
冨
騒
李
敲
家
伊
イ
る
境
獅
尤
津
覗
容
艫
藿
附
啗
后
顙
伍
ざ
鰆
超
頸
庸
顧
帝
妓
怡
道
鐙
窹
下
伐
棗
屎
朧
ど
還
窕
侮
筮
算
状
涙
隈
損
憶
知
漸
オ
戻
垢
卦
攷
子
楫
橙
帳
屯
石
雄
牽
正
幕
祠
液
例
堅
医
鱣
鍾
景
背
飮
儉
答
勺
姿
計
値
緻
晩
輯
燒
爺
綱
原
戲
蛉
椋
燥
鬻
蘩
判
鎭
進
抵
ト
韻
懷
匂
惰
瑠
匕
梼
珍
健
已
迚
蟹
兆
狹
拓
喪
突
駈
澳
凰
穹
寵
管
往
焔
主
鍬
輝
ペ
晒
謁
秡
脊
衾
竿
搏
領
嫉
轉
蔑
鉛
提
曳
代
住
壁
罷
庵
霹
庁
徤
躡
宵
讃
浜
屋
撰
雑
ぜ
祢
絹
罪
塒
淳
謬
兪
地
飄
雁
鋲
勾
欲
鑽
召
社
絞
頬
爭
茶
雪
扨
解
羨
灌
笥
吊
慮
咒
畢
吼
学
蘓
回
琶
龜
拇
裔
慶
茗
握
涅
延
心
驅
括
域
倉
賃
沓
葦
饑
サ
斛
轍
吠
鈔
皮
魂
輕
凧
柏
魁
す
逅
抄
辤
版
盛
萆
顰
怠
堯
辱
滞
娣
奢
仗
ほ
馳
猩
槖
苫
俚
巻
魔
稽
冬
軆
斎
鐫
麵
拾
卥
筋
鳩
彳
稷
佩
然
匙
棹
倚
樣
倹
俯
鯨
掻
笑
髷
貳
颭
廳
私
任
賽
蔞
但
叙
楠
陰
嘉
鰭
吐
呀
隺
彊
簟
枕
暄
も
腰
機
典
粗
棺
晝
醭
在
阻
撫
骸
菟
蔽
旅
踰
少
膽
囚
渣
白
妙
焼
迹
狐
逈
愁
過
趣
慣
遺
痒
飽
隆
禱
嗚
饀
饂
涸
砥
食
蠡
鬚
弉
揺
鴫
翼
難
僮
筒
希
扣
祿
閒
卅
祐
泔
鯰
豊
肌
譏
繪
圖
委
奪
叮
酔
ズ
噺
銚
鑵
令
朔
寄
篷
馨
彰
鮠
薪
驚
脯
珠
鱒
竪
蜜
専
ヒ
美
破
酒
梓
猨
鵆
塚
で
烙
掲
饅
縫
拂
襠
ゼ
夾
○
錦
仙
鯉
墓
鼇
皃
減
想
帶
餻
臻
韭
混
政
群
鴨
飯
亮
殊
裾
幽
弄
旬
航
芋
犠
匹
鰈
實
発
嘯
廽
麗
葎
菰
筐
鶺
蚩
禍
昇
笠
遷
蚣
浚
奧
桿
姫
挟
謗
脱
畝
赦
輔
紗
圓
數
漫
舊
祟
慈
臭
牌
兄
溝
妣
炷
苟
公
砲
轎
燧
袁
夷
頁
滓
桒
床
搔
潔
瞋
を
顚
閑
麥
蠢
飴
釄
審
秤
鬟
録
翔
迭
挽
腮
喋
駒
屢
釡
弓
衒
泥
わ
疲
鐘
芬
霊
螂
稔
