name: "encoder"
platform: "tensorrt_plan"
max_batch_size: 0
input [
    {
    name: "input"
    data_type: TYPE_FP32
    dims: [-1, 3, 32, 128]
    }
]
output [
    {
    name: "output_encoder"
    data_type: TYPE_FP32
    dims: [-1, -1, 256]
  }
]

default_model_filename: "encoder_merge.plan" 